{"source_units": ["You can say all you want about the thick fogs in England, ", "but I'm telling you now, ", "sure as I'm standing here, ", "that England's fogs don't hold a candle to the thick fogs that roll in ", "over the Bay of Fundy ", "here in Maine.", "The fog here gets so thick you can drive a nail into it ", "and hang your hat on it. ", "It's the honest truth. ", "My neighbor Dave ", "works a fishing boat, ", "but he can't do any work when a Maine fog comes rolling into the bay. ", "He always saves up his chores for a foggy day. ", "One day, the fog came rolling in overnight,", "and Dave knew there was no way he could go fishing that day. ", "He instead decided that his roof needs shingling, ", "so he got started at the shingling right after breakfast", "and didn't come down until dinner. ", "\"Sarah, we sure do have a mighty long house,\" he told his wife ", "over supper. ", "\"It took me all day to shingle.\" ", "Well, Sarah knew right enough that they lived in a small house, ", "so she went outside to take a look. ", "To her surprise, ", "she discovered that Dave had shingled right past the edge of the roof ", "and out onto the fog!"], "response_units": ["i 'll tell you now that there is no fog thicker than the fog that rolls in here in maine .", "sure the fog in london is pretty thick", "but it does n't hold a candle to the fog here .", "it is so thick you could take a nail and stick it in", "and hang your hat on it", ". that 's the honest truth . \t\t i have a friend", "who owns a fishing oat", "and he knows when a maine fog rolls in he wo n't be able to do any work at all the next day .", "one night he saw the fog coming in", "he decided he was going to shingle his roof", "so the next morning he started before breakfast", "and worked all the day past supper", ". after finishing he sat down with his wife", "to eat", "and said to her \" boy , we sure do have a long house , it took me all day to finish the roof \" .", "the wife , having good enough sense in her , knew they had in fact a small house", "and went to check her husband 's work .", "sure enough , she was surprised", "to see that he had shingled the whole roof", "and had kept going out beyond the house a few feet over !"], "correspondences": [-2, 0, -2, 6, 7, -2, 10, -2, -2, 15, 16, 17, -2, 19, -2, 21, -2, 23, 24, -2], "source_spans": [[0, 58], [58, 83], [83, 110], [110, 181], [181, 203], [203, 217], [217, 273], [273, 298], [298, 321], [321, 338], [338, 360], [360, 430], [430, 477], [477, 520], [520, 581], [581, 631], [631, 687], [687, 722], [722, 785], [785, 798], [798, 831], [831, 895], [895, 931], [931, 948], [948, 1018], [1018, 1039]], "response_spans": [[0, 88], [89, 128], [128, 174], [174, 227], [227, 250], [-1, 43], [294, 317], [317, 408], [409, 443], [448, 491], [493, 541], [541, 575], [575, 619], [619, 626], [626, 718], [718, 797], [797, 835], [835, 866], [866, 909], [909, 965]]}