{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the thick fogs in England.", "They don't have anything on the fog that comes in over Fundy, Maine.", "I'm telling you that it gets so thick up here that you could drive a nail through the fog that comes over Maine.", "I have a friend who owns a fishing boat, and he saves all his chores for those foggy days.", "Well, one day it was so foggy that he couldn't go fishing so he decided to shingle his house.", "He was up shingling all day.", "When he came in for dinner, he told his wife, \"my goodness we have such a long house!", "It took me all day to shingle!\"", "She thought about it, and knew that their house was actually rather small.", "She went out to look at what he had done, and he kept on shingling right past the house!"], "correspondences": [0, 0, 1, 4, 5, 6, 7, 8, 9, 6], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 57], [57, 125], [125, 237], [237, 327], [327, 420], [420, 448], [448, 533], [533, 564], [564, 638], [638, 726]]}