{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the fogs in England but I swear on all that's true that the Maine fogs over the Bay of Fundy are so thick that you can hammer a nail into it and hang your hat on it.", "My friend Dave works a fishing boat and he can't work when the fog is out.", "One day there was a thick fog coming in and he knew right away that he wouldn't be able to go out.", "He decided that the roof needed shingling and went up in the morning and did not come out until dinner.", "\"Sarah we sure do have a long house\" he told his wife over supper.", "Sarah thought about this knowing that she had a small house.", "She went outside and sure enough the roof had been shingled but at the end of the roof Dave had shingled into the fog."], "correspondences": [0, 3, 5, 6, 7, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 196], [196, 270], [270, 368], [368, 471], [471, 537], [537, 597], [597, 715]]}