{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["Well you may say, that nothing compares to the foggy nights of old London town; however I contend that those England fog filledtimes, have nothing on our own Maine fogfilled nights.", "I will tell you a tale.", "His friend liked to save up his chores for when the storms came in.", "Normally he fished every day, since he was a fisherman, however he couldn't work due to storm, so he set to shingling his roof that morning.", "He shingled through lunch and until dinner time, when his wife Laura came out with his supper.", "He asked , How large  \"is our house\"  she said its small, and what are you still doing , she answered.", "He had thought it seemed just then like our house was long and not short; he went to examine and had shingled off the roof and into the fog filled sky with the nails, he plucked."], "correspondences": [0, 0, 4, 5, 6, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 181], [181, 204], [204, 271], [271, 411], [411, 505], [505, 607], [607, 785]]}