{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["England doesn't have anything on us, inregards to the weather.", "Particalarly of note  is the fog is so bad.", "How bad?", "The fgog gets so thick you can drive a shingle on to it.", "It,s the honest truth\n\n\n\nMy friend dave work s on afishing boat.", "However  one day he couldn't work so decided to shingle his roof.", "This took half a day.", "At five pm, his wife Samantha comes out and says what have you been shingling,  what are you doing \n\nWe have small house.", "Dave looked to see, and it turned out he had shingled past their small roof, and into the fog, much to his suprise\n\n\n\n\n\nSo it turns out, the fog gets so bad….", "Quite a tall tale , out here in Longwood.", "The fog gets so\n\n\n\ntall tale"], "correspondences": [0, 1, 0, 1, 3, 6, 5, 7, 10, 9, 1], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 62], [62, 105], [105, 113], [113, 169], [169, 233], [233, 298], [298, 319], [319, 440], [440, 598], [598, 639], [639, 667]]}