{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the thick fogs of England, but I'm tell you, as sure as I'm standing here, that they don't hold a candle next to the thick fogs that roll into Fundy Bay here in Maine.", "When a fog rolls in you can sink a nail in it or hang your hat on it.", "It's the honest truth.", "My neighbor Dave works on a fishing boat.", "He saves all of his choirs for a foggy day.", "One day a fog was rolling in over night and Dave knew that he was not going to be able to fish that day.", "Instead he decided that he needed to shingle his roof.", "So right after breakfast he went up to the roof and didn't come back down til dinner.", "\"Sarah, you have a mighty long house,\" he said to his wife.", "\"I went right up to the roof after breakfast and didn't come down 'til supper.\"", "Well Sarah knew very right that they lived in a small house, so she went out to see the shingling.", "To her surprise, Dave had shingled right past the edge of the roof and out onto the fog!"], "correspondences": [0, 1, 2, 3, 4, 5, 6, 6, 7, 6, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 198], [198, 267], [267, 289], [289, 330], [330, 373], [373, 477], [477, 531], [531, 616], [616, 675], [675, 754], [754, 852], [852, 940]]}