{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about England fogs being thick, but I tell you they don't hold a candle to the fogs we get here in the Bay of Fundy in Maine.", "Fogs here get so thick you can put a nail through it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave is a fisherman and can't do any work when a Maine fog comes through.", "He saves up all of his chores for when it is foggy.", "One evening, a thick fog came through and Dave knew he wasn't going to be able to work the next day.", "He decided he needed to shingle his roof.", "He started to shingle at breakfast and didn't finish until dinner time.", "As he came in from the house he told his wife, \"I didn't realize how long our house I was out there shingling all day.\"", "His wife knowing that they have a small house went outside to take a look.", "Sure enough he had shingled right past the edge of the roof and onto the fog!"], "correspondences": [0, 1, 2, 3, 4, 5, 6, 6, 7, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 150], [150, 227], [227, 249], [249, 334], [334, 385], [385, 485], [485, 526], [526, 597], [597, 716], [716, 790], [790, 867]]}