{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the thick fogs of England, but I'm telling you as sure as I'm standing here, they don't hold a candle up to the type of fog that comes in over the Bay of Fundy here in Maine.", "The fog here gets so thick that you could drive a nail into it and hang your hat up.", "That's the honest truth.", "My neighbor Dave owns a fishing boat, and he knows that when a thick fog comes in, he has no chance to get out.", "Well, one time, the thick fog rolled in overnight  and it was already set when he woke up.", "He thought it'd be a good day to shingle the house.", "He got started right after breakfast, and didn't come in until dinner.", "\"Sarah, I tell you, we have such a long house,\" he told his wife.", "\"I've been out there all day putting shingles on that roof.\"", "Sarah knew that they didn't have all that long of a house, so she went out to go check out what Dave had done.", "She walked along the house and noticed that he had shingled right off the edge of the roof and onto the fog!"], "correspondences": [0, 1, 2, 3, 5, 9, 6, 7, 6, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 205], [205, 289], [289, 313], [313, 424], [424, 514], [514, 565], [565, 635], [635, 700], [700, 760], [760, 870], [870, 978]]}