{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["I don't care what anyone says New England fogs are much thicker than London fogs.", "The fog over ______ bay is so thick that you could hammer a nail into it and hang a hat on it.", "I had a friend who makes a living as fisherman and even he does not go out when the fog is too thick.", "One day he noticed the fog was rolling in and knew he was not going to be able to go out that day.", "So he decided to shingle his house.", "He climbed up in the morning and did not come back down until dinner time.", "Over dinner he commented to his wife that they sure had a long house.", "She looked at him and then went outside.", "Her hunch had been correct.", "The house had been shingled and at the end of the roof her husband had kept on shingling right onto the fog."], "correspondences": [0, 1, 9, 5, 6, 6, 7, 6, 7, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 81], [81, 175], [175, 276], [276, 374], [374, 409], [409, 483], [483, 552], [552, 592], [592, 619], [619, 727]]}