{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["I've heard the fog in England is bad, but let me tell you, there's nothing that compares to the fog you can find off the bay of Maine.", "True as I'm standing here, you can cut a hole in the fog with a knife.", "My neighbor works as a fisherman out on the bay, and, when the fog rolls in, he usually takes the day off to work around the house.", "A couple of weeks ago, he woke up to fog so thick you couldn't see a foot in front of you, so he decided it would be a good day to reshingle the house.", "He stayed on the roof all day, from breakfast to dinner, putting up more shingles.", "At dinner, he exclaimed to his wife, \"My, we sure do have a long house!", "I've been up there since sunrise shingling and just now finished.\"", "Now, his wife knew they had a little house, so she decided to go outside and look at his work.", "Sure enough, she looked up, and her husband had continued shingling past the edge of the roof and right onto the fog!"], "correspondences": [0, 0, 3, 9, 6, 7, 6, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 134], [134, 204], [204, 335], [335, 486], [486, 568], [568, 639], [639, 705], [705, 799], [799, 916]]}