{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, they don't hold a candle up to the fogs that roll into the Bay of Fundy in Maine.", "They are so thick you can drive a nail into it and hang your hat on it.", "That's the honest truth.", "My neighbor Dave runs a fishing boat and he cant works on the days there is fog.", "He saves up all his chores for a foggy day.", "Well one day thick fog rolled in over night and at breakfast he decided to shingle the house.", "He started after breakfast and worked all the way until dinner.", "At dinner he exclaimed to his wife, \"Sarah I don't remember our house being so big.\"", "Sarah knew they had a small house and went out to look.", "She found that he had shingled the roof and right out past it onto the fog."], "correspondences": [0, 1, 2, 3, 4, 5, 6, 7, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 164], [164, 235], [235, 259], [259, 339], [339, 382], [382, 475], [475, 538], [538, 622], [622, 677], [677, 752]]}