{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["People say that the fogs of England are thick, but I'm telling you, they don't hold a candle to a Maine fog.", "The fogs that roll into this bay are so thick you could hammer a nail into them and hang your hat on it.", "It's the honest truth.", "My friend Mark works a fishing boat, but you can't fish when the fogs roll in.", "You just can't see anything.", "He always saves his chores for a foggy day.", "One day, the fogs rolled in overnight, and Mark knew he wouldn't be able to fish at all, so he decided his roof needs re-shingling.", "He started after breakfast and didn't come down until dinner.", "\"We sure do have a mighty long house, Sarah,\" Mark told his wife over supper.", "\"It took me all day the shingle the roof.\"", "Well, Sarah knew that they had a very short house, so she went out after supper to look.", "To her surprise, Mark had shingled right past the roof and onto the fog!"], "correspondences": [0, 1, 2, 3, 0, 4, 5, 6, 7, 8, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 108], [108, 212], [212, 234], [234, 312], [312, 340], [340, 383], [383, 514], [514, 575], [575, 652], [652, 694], [694, 782], [782, 854]]}