{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the thick fog in England.", "I live in the Bay of Fundy in May, and you can't hold a candle to the fog here as compared to the fog in England.", "You could hammer a nail through the fog and hang a hat on it.", "When there is fog here in Maine, you can't do much.", "My neighbor Dave knows that he can't fish in the fog, so he saves his chores to do when it is really foggy and he can't fish.", "One day, there was a lot of fog overnight and Dave woke up and knew he couldn't fish.", "He decided to eat breakfast and then start to put new shingles on his roof.", "It took him all day.", "He said to his wife Sarah at dinner, \"Wow our house is so long\".", "I was up putting new shingles on from breakfast until dinner.", "Sarah knew that they lived in a small house, so she went outside to look at what Dave did.", "Sure enough, he put shingles past the roof of the house and into the fog!"], "correspondences": [0, 0, 1, 0, 3, 5, 6, 8, 7, 6, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 56], [56, 169], [169, 230], [230, 281], [281, 406], [406, 491], [491, 566], [566, 586], [586, 650], [650, 711], [711, 801], [801, 874]]}