{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the thick fogs in England, but I can tell you, sure as I'm standing here, that England's fogs don't hold a candle to the fogs that roll in over the Bay of Fundy here in Maine.", "The fog gets so thick that you can drive a nail into it and hang your hat on it.", "That's the honest truth.", "My neighbor Dave has a fishing boat, but he can't do work when the fog rolls in.", "He saves his chores up for a foggy day.", "One day, a thick fog rolled in overnight and Dave knew he could not do work that day.", "He decided that his house needed shingling.", "He went out right after breakfast and didn't come back in until dinner.", "He said to his wife, Sarah, \"we sure do have a mighty long house.", "It took me all day to shingle!\"", "Sarah knew well enough that they had a small house so she went outside to take a look.", "Sure enough, Dave had shingled the entire roof and then kept on putting shingles out on the fog!"], "correspondences": [0, 1, 2, 3, 4, 5, 6, 6, 7, 8, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 206], [206, 286], [286, 310], [310, 390], [390, 429], [429, 514], [514, 557], [557, 628], [628, 693], [693, 724], [724, 810], [810, 906]]}