{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["The London fog doesn't hold a candle to the fog that comes over the Bay of fundy in maine.", "It is so thick you could hammer a nail in it and a hang a hat on it.", "There was a fisherman who lived in Maine.", "When the fog was coming he knew he couldn't fish so he saved all his chores for that day.", "One day when the fog was really bad he decided to redo the roof.", "He went out after breakfast and stayed long after dinner.", "When he eventually came down he said to his wife wow what a long roof we have.", "She knew that they had a small roof and went outside to check.", "Her husband had nailed roofing all the way into the fog!", "!"], "correspondences": [0, 1, 9, 5, 5, 6, 6, 9, 10, 0], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 90], [90, 158], [158, 199], [199, 288], [288, 352], [352, 409], [409, 487], [487, 549], [549, 605], [605, 606]]}