{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the fogs in England, but I'm telling you, sure as I'm standing here, that our fogs here in the Bay of Fluck in Maine are way thicker.", "Our fogs are so thick, you could drill a nail and hang your hat on them.", "It's the honest truth.", "My neighbor Dave is a fisherman, but he can't fish when it gets too foggy.", "He always saves his chores for a foggy day.", "One day, a fog rolled in overnight and he knew he could not go fishing the next day.", "He then decided that he would shingle the roof of his house instead.", "He shingled from early morning until dinner at night.", "When he came home, he told his wife over supper, \"Wow, we sure do have a long house.", "It took me all day to shingle!\"", "His wife, knowing they have a small house, went outside to take a look.", "To her surprise, he had not only shingled the roof, but he had shingled out onto the fog!"], "correspondences": [0, 1, 2, 3, 4, 5, 6, 6, 7, 8, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 164], [164, 236], [236, 258], [258, 332], [332, 375], [375, 459], [459, 527], [527, 580], [580, 664], [664, 695], [695, 766], [766, 855]]}