{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["Let me tell you about the fogs of certain parts of Maine.", "They put the famed fogs of England to shame.", "So severe are Maine fogs, the similarly renowned fish market of the state is regularly stifled by this natural phenomenon.", "Once a fisherman friend of mine encountered a fog like this upon exiting his home one morning for a fishing trip.", "\"Drats!\"", "he exclaimed, knowing his plans were awash.", "He resigned himself to shingle his roof, a much delayed task.", "He tacked on tile after tile, essentially from sunrise to sundown.", "\"Didn't realize our roof was so long!\"", "he exclaimed to his wife.", "Knowing the home a little better than her husband, she looked outside.", "Sure enough, the fisherman had tiled beyond the house and onto the fog itself."], "correspondences": [0, 0, 0, 3, 0, 7, 6, 6, 6, 7, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 57], [57, 101], [101, 223], [223, 336], [336, 344], [344, 387], [387, 448], [448, 514], [514, 552], [552, 577], [577, 647], [647, 725]]}