{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["People loved to talk about London's fog, but it did not compare to Maine's.", "Maine's fogs were so intense, you could supposedly stick a nail through it.", "There lived a man and his wife.", "The man fished for a living, but when the Maine fog was too intense for him to fish in, the man would stay home and complete chores he'd been meaning to do for a  while.", "One day, the fog had come in overnight.", "So the man couldn't go to work.", "So, he decided to put shingles on their roof.", "He worked right after breakfast, up until dinnertime.", "It took him all day.", "At supper, the husband told his wife that they had an awfully long house.", "The woman was in disbelief because she knew just how spacious their house was and she didn't believe it could've been as long as her husband said.", "So, she went outside to see the work he'd done on the roof, only to find out that her husband had shingled the part of their roof that was visible as well as had gone into the fog to finish up the remaining parts.", "She'd never even known that part of the roof existed!"], "correspondences": [0, 0, 7, 9, 5, 9, 6, 6, 8, 7, 9, 10, 9], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 75], [75, 150], [150, 181], [181, 350], [350, 389], [389, 420], [420, 465], [465, 518], [518, 538], [538, 611], [611, 757], [757, 970], [970, 1023]]}