{"source_units": ["You can say all you want about the thick fogs in England, but I'm telling you now, sure as I'm standing here, that England's fogs don't hold a candle to the thick fogs that roll in over the Bay of Fundy here in Maine.", "The fog here gets so thick you can drive a nail into it and hang your hat on it.", "It's the honest truth.", "My neighbor Dave works a fishing boat, but he can't do any work when a Maine fog comes rolling into the bay.", "He always saves up his chores for a foggy day.", "One day, the fog came rolling in overnight, and Dave knew there was no way he could go fishing that day.", "He instead decided that his roof needs shingling, so he got started at the shingling right after breakfast and didn't come down until dinner.", "\"Sarah, we sure do have a mighty long house,\" he told his wife over supper.", "\"It took me all day to shingle.\"", "Well, Sarah knew right enough that they lived in a small house, so she went outside to take a look.", "To her surprise, she discovered that Dave had shingled right past the edge of the roof and out onto the fog!"], "response_units": ["You can say all you want about the fog in England, but I say, as I stand here there is nothing that compares to the fog in the Bay of Fundy here in Maine.", "The fog is so thick that you can drive a nail into it and hang your hat.", "It's the honest truth.", "My neighbor Dave is a fisherman on the bay.", "When the fog rolls in, fisherman cannot do their jobs.", "They tend to save up their chores for a foggy day.", "Overnight the fog came rolling in and Dave decided that he could not fish that day.", "So, he decided that he would spend the day putting in a new roof.", "He started after breakfast and worked until dinner.", "\"My, what a mighty long house we have\" Dave told his wife Sarah when he was finished.", "Sarah knew that they had a small house, so she went outside to take a look.", "She was shocked to find out that Dave had shingled the entire house and continued out and put shingles on the fog as well!"], "correspondences": [0, 1, 2, 3, 3, 4, 5, 6, 6, 7, 9, 10], "source_spans": [[0, 217], [217, 297], [297, 319], [319, 427], [427, 473], [473, 577], [577, 718], [718, 793], [793, 825], [825, 924], [924, 1032]], "response_spans": [[0, 154], [154, 226], [226, 248], [248, 291], [291, 345], [345, 395], [395, 478], [478, 543], [543, 594], [594, 679], [679, 754], [754, 876]]}