{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot sunny day and Rachel and kaylie decided to take advantage of their day off from work.", "They decided to drive down to old orchard beach in maine.", "The sun was a blistering optimistic pellet in the sky.", "When they got there the ocean was bright blue and veered off into the horizon.", "People swarmed everywhere.", "They laid on pink, yellow, orange and white towels while other laid on lawn chairs with sun hats brimming their eyes and shielding them from the sun.", "Children ran around making sand castle with smooth shells.", "Kaylie went to lie down on a towel and Rachel went to cool off in the water\n\nThe sun was shining on the water making it glitter.", "A young girl ran past in a little purple bathing suit with yellow floaties.", "a boy was chasing her in a green bathing suit.", "It reminded Rachel of the days when she used to go to the beach with her brothers.", "She smiled she was absent of all anxieties at least for a little while.", "It really was a perfect day."], "correspondences": [0, 1, 1, 2, 3, 4, 5, 5, 7, 7, 0, 11, 11], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 98], [98, 155], [155, 209], [209, 287], [287, 313], [313, 462], [462, 520], [520, 648], [648, 723], [723, 769], [769, 851], [851, 922], [922, 950]]}