{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["Two girls decided to go to Old Orchard Beach on their day off from work, so they packed up their car and drove out on the road.", "The sun was a like blistering, yellow pellet in the sky and burned down on them as they drove.", "When they parked by the beach, they saw a lot of people had already gathered there.", "There were kids building sand castles with sea shells, people leaning back in lounge chairs with wide-brimmed sunhats shielding their faces, and others laying down in the sand on pink, white, orange, and yellow towels.", "One of the girls laid down on the sand to nap, while the other went down to the water to cool off.", "The girl in the water felt peaceful as she looked out across the water that sparkled like a million tiny crystals.", "Overhead, four teenagers were hang-gliding through the air, and she.", "She watched a girl in a yellow swimsuit and purple floaties run past her, followed by a boy in green swimming shorts.", "The sight made her nostalgic as she remembered going to the beach and playing with her brothers.", "After a hwile, she returned to lay down next to her friend on sand."], "correspondences": [0, 1, 10, 4, 5, 6, 10, 8, 11, 12], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 127], [127, 221], [221, 304], [304, 522], [522, 620], [620, 734], [734, 802], [802, 919], [919, 1015], [1015, 1082]]}