{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day by taking a trip to the beach.", "They hopped in the car and drive to Old Orchard Beach Maine.", "Once they arrived, they could see that the beach was full of people.", "Some were stretched out on yellow, orange, white, and pink towels, while other stretched out on lounge chairs, broad brimmed hats shielding their eyes from the rays of the sun.", "Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shone off the water, making it look like a million crystals.", "Just before she reached the water, Rachel saw a girl in a light purple swimsuit with yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming short.", "Rachel smiled reminiscing on beach memories with her brothers.", "Once in the water, Rachel looked up and saw four teenagers sailing paragliders.", "She smiled and thought that this was the perfect place to be.", "Then she went to lay down in the sand with Kaylie."], "correspondences": [0, 1, 1, 4, 5, 6, 7, 8, 9, 10, 11, 12], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 119], [119, 179], [179, 247], [247, 423], [423, 537], [537, 605], [605, 718], [718, 804], [804, 866], [866, 945], [945, 1006], [1006, 1056]]}