{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot, sunny day and Rachel and her friend Kaylie decided it would be a good day to go to the beach.", "They headed out to Old Orchard beach in Maine.", "The sun looked like a hot, yellow pellet in the sky.", "There were people laying under beach umbrellas wearing wide brimmed hats.", "Rachael decided that she would like to lay down in the sun before going swimming.", "Kaylie dedcided to go for a swim.", "A little girl in a light purple bathing suit with two floaties darted out in front of her followed closely by a boy in green shorts.", "Kaylie smiled to herself remembering long past beach days with her brothers.", "She saw 4 teenagers flying paragliders.", "She thought about this as she walked over to lay down next to Rachel, thinking about what a perfect day this was turning out to be."], "correspondences": [0, 1, 1, 4, 12, 12, 8, 9, 10, 11], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 107], [107, 153], [153, 205], [205, 278], [278, 359], [359, 392], [392, 524], [524, 600], [600, 639], [639, 770]]}