{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["Two girl friends had a day off of work so they decided to take a trip and spend it at the beach!", "The sun was a bright shining yellow ball in the sky when they took off for the beach.", "They drove for an hour and then finally made it.", "When they were walking out of the parking lot, they saw the crystal blue water shining up at them.", "When they made it to the beach, they saw that it was full of sunbathers with yellow, orange, and pink towels.", "One girl decided to lay down her towel and take a quick nap in the warm sand.", "The other girl decided to take a dip in the water.", "She walked towards the water that was reflecting the light back like a million little crystals.", "She was about to step into the water when two little children, one boy in purple swim trunks and one girl, ran right past her.", "She smiled and reminisced on the days that she spent at the beach with her brothers.", "She waded out into the water and spent a few minutes reflecting.", "She saw a group of teenagers flying rainbow kites in the sky.", "She thought, \"this really is the perfect day\".", "It allowed them to get away from all of the normal stressors and daily hassles of life.", "She then walked back towards the other girl and laid her towel next to her on the warm sand."], "correspondences": [0, 1, 0, 2, 7, 5, 0, 2, 7, 9, 10, 10, 11, 11, 5], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 96], [96, 181], [181, 229], [229, 327], [327, 436], [436, 513], [513, 563], [563, 658], [658, 784], [784, 868], [868, 932], [932, 993], [993, 1039], [1039, 1126], [1126, 1218]]}