{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot and sunny day and Kaylie and Rachel decided to take advantage of their day off and take a trip to the beach.", "The sun was a yellow optimistic pellet in the sky as they drove to Old Orchard Beach in Maine.", "As they approached the beach, they saw the crystal water that faded into deep blue on the horizon.", "The beach was swarmed with people.", "People were on yellow, orange, white, and pink towels, while others were stretched out on lounge chairs wearing wide brimmed hats shading their eyes from the suns rays.", "Children were decorating sand castles with smooth shells.", "Kaylie decided to take a quick nap while Rachel went to the ocean to cool off.", "As Rachel reached the surf of the crystal waters, a little girl in a purple bathing suit with freckles and yellow floaties darted in front of her followed by a little boy in green swim shorts.", "She smiled as she reminisced about beach days with her brothers.", "While she was in the water, she watched four teenagers fly beautiful paragliders.", "She felt like the day was perfect.", "She closer her eyes for a few moments to savor the experience as she felt her anxieties slip away.", "She got up and joined Kaylie on the sand."], "correspondences": [0, 1, 2, 3, 4, 5, 0, 7, 9, 10, 11, 11, 5], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 121], [121, 215], [215, 313], [313, 347], [347, 515], [515, 572], [572, 650], [650, 842], [842, 906], [906, 987], [987, 1021], [1021, 1119], [1119, 1160]]}