{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["One day, Kaylie and Rachel decided to visit Old Orchard Beach in Maine to take advantage of their day off.", "The sun was an optimistic yellow pellet, and the water glistened like crystals before fading into a dark blue on the horizon, when they arrived at the parking lot.", "Some people were on yellow, pink, white, or orange towels, while others were stretched out on lounge chairs wearing wide-brimmed hats to shield their eyes from the sun.", "Children were decorating sandcastles with smooth seashells.", "After reaching the beach, Rachel decided to cool off in the water while Kaylie took a nap on the sand.", "After heading into the surf, Rachel watch a young girl in a light purple bathing suit with small yellow floaties go darting past her, followed by a boy in a green swimsuit.", "Rachel smiled as she reminisced about beach days past with her brothers.", "Rachel watched four teenagers flying colorful paragliders above her, and determined that this was truly a perfect day, as her anxieties of life faded away for a while.", "Rachel then returned to the shore to join Kaylie to lie down on the warm sand."], "correspondences": [0, 2, 4, 5, 5, 7, 9, 11, 12], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 106], [106, 269], [269, 437], [437, 496], [496, 598], [598, 770], [770, 842], [842, 1009], [1009, 1087]]}