{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a warm, sunny days so my friend and I decided to go to the beach.", "As we drove, the sun looked like a bright yellow ball in the sky.", "When we arrived at the beach the parking lot was full and I could see the where the blue sky met the white sand.", "We walked towards the beach and it was crowded or people, laying out, playing, and swimming, My friend decided she want the lay down her beach towel and take a nap.", "I decided to walk to the ocean and cool off.", "As I was walking, a little girl in a yellow and purple swimsuit ran in front of me, followed by her little brother.", "It reminded me of my little brother and I at the beach years ago.", "I looked out into the ocean and say a couple of teen boys parasailing in the distance.", "I walked back to my friend, laid out my towel, and started to take a nap.", "I thought to myself, today is the perfect day."], "correspondences": [0, 2, 2, 5, 0, 7, 11, 10, 12, 11], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 72], [72, 137], [137, 249], [249, 413], [413, 457], [457, 572], [572, 637], [637, 723], [723, 796], [796, 842]]}