{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot sunny day and Rachel and Kaylie decided to take advantage of their off-day and take a trip to the beach.", "The sun was a golden yellow pellet blistering in the sky as they went to Old Orchard Beach in Maine.", "On their way in from the parking lot, they noticed the crystal clear water sparkling blue.", "The beach was crowded with patrons.", "Some were laying out on towels that were yellow, orange, white or pink.", "Others were laying on lounge chairs with brimmed hats that were shading them from the sun.", "Kaylie decided to lay out on the beach and take a nap, while Rachel decided to go into the water to cool off.", "The sun was glistening on the water that made it look like a lot of small crystals.", "Right before Rachel got to the surf, a young freckled girl in a purple bathing suit and yellow floaties on her arm cut in front of her.", "A boy with green swimming shorts followed closely after her.", "Rachel reminisced on memories with her brothers at the beach.", "A short while later, Rachel looked up and saw four teenage boys flying colorful paragliders in the sky.", "This was turning out to be a perfect day and Rachel felt all of her daily anxieties disappearing for a little while.", "She closed her eyes to savor the moment and then went to join Kaylie on the beach."], "correspondences": [0, 1, 2, 3, 4, 4, 0, 6, 7, 8, 9, 10, 11, 12], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 117], [117, 217], [217, 307], [307, 342], [342, 413], [413, 503], [503, 612], [612, 695], [695, 830], [830, 890], [890, 951], [951, 1054], [1054, 1170], [1170, 1252]]}