{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot sunny day at the beach and Kaylie and Rachel decided to take advantage of an off day and head down to the beach.", "The sun was an optimistic yellow pellet blistering in the sun.", "They pulled into the parking lot and as they began to approach the shore line they saw the crystal clear water fading back into the blue horizon.", "The beach was swarming with people in the ocean and sitting on the beach on pink, blue, yellow and white towels.", "Kaylie put her towel down and laid on the beach while Rachel headed to the ocean to take a swim.", "As she approached the water a little girl wearing a yellow and pick polka dotted bathing suit ran next to her followed by a boy in a green swimming suit.", "Rachel thought back on how she used to go to the beach with her brothers when she was younger.", "She felt that this day was perfect and was happy that all of her anxieties were gone for the day.", "She deciede to stay in the water for a little longer before finally heading back over to r"], "correspondences": [0, 1, 2, 4, 5, 7, 11, 11, 12], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 125], [125, 187], [187, 332], [332, 444], [444, 540], [540, 693], [693, 787], [787, 884], [884, 974]]}