{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot sunny day and Kaylie and Rachel decided to take advantage of their off-day so they decided to go to Old Orchard Beach in Maine.", "When they were walking from the parking lot, they noticed the sun was a bright yellow color and blistering through the sky and the water was a nice ocean blue.", "When they got to the beach, they noticed some people laying in the sand on pink, purple, yellow, and orange towels, while others were laying on beach chairs.", "Kaylie decided to lay on her towel and take a nap while Rachel decided to go in the water to cool off.", "Rachel started walking into the water.", "She saw a small girl with freckles in a purple bathing suit cut in front of her in the water as she was being chased by a boy in a green bathing suit.", "This reminded her of the times that she would be in the water with her brothers.", "She then saw four teenagers flying paragliders.", "She closed her eyes to savor this perfect moment.", "She felt that all of her anxieties from her life just disappeared for a while.", "She then got out of the water and went to join Kaylie on the beach."], "correspondences": [0, 2, 4, 0, 2, 7, 11, 10, 12, 11, 0], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 140], [140, 299], [299, 456], [456, 558], [558, 596], [596, 746], [746, 826], [826, 873], [873, 922], [922, 1000], [1000, 1067]]}