{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot, sunny day when Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was a blistering, yellow pellet in the sky as the girls drove to Old Orchard Beach in Maine.", "The girls saw the crystal clear water turn to deep blue at the horizon as they from the parking lot.", "The beach was swarming with people.", "Some people were laying on yellow, orange, white, and pink towels while others could be seen stretching out on chairs.", "Kaylie decided to lay her towel day in the sand and take a quick nap while Rachel decided to cool off by taking a dip in the ocean.", "The sun bounced off the water making it look like a million, tiny crystals.", "Just as Rachel got to the water, a girl with freckles in a purple swimming suit and yellow floaties ran in front of her.", "Her brother, wearing green swim trunks, chased her into the waves.", "She reminisced on the her childhood days of playing with her brothers at the beach.", "As she was leaving the water, she saw four teenagers flying colorful paragliders.", "All of her daily anxieties disappeared for this day.", "She decided the moment was perfect and closed her eyes to savor the moment before walking up the beach to lay next to Kaylie in the warm sand."], "correspondences": [0, 1, 2, 3, 4, 0, 6, 7, 8, 9, 10, 11, 12], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 119], [119, 219], [219, 319], [319, 354], [354, 472], [472, 603], [603, 678], [678, 798], [798, 864], [864, 947], [947, 1028], [1028, 1080], [1080, 1222]]}