{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot sunny day in Maine and Kaylie and Rachel decided to take advantage of their day off and go to the beach.", "The sun was a yellow pellet in the sky blistering down on them.", "As they approached the beach they saw the crystal clear waters which faded into a deep blue on the horizon.", "As the sun shone down on the water it looked like a million  sparkling diamonds.", "There were tons of people at the beach today.", "Some laid on pink, yellow, orange, and white blankets and some wore broad hats to shield their eyes from the rays.", "Children were decorating sandcastles with round shells.", "Kaylie decided to have a nap in the hot sun.", "Rachel decided to go to the ocean to cool off.", "As she approached the water she saw a young girl in a purple bathing suit with yellow floaties.", "The girl was quickly followed by a young boy in green swimming pants.", "Rachel reminisced about the times when her and her brothers would play at the beach.", "As she was standing in the surf she saw teenagers above gliding on paragliders.", "Rachel thought to herself today was truly a perfect day and all her anxieties from her daily life melted away.", "She walked back towards the beach and laid down by Kaylie for a nap."], "correspondences": [0, 1, 2, 6, 3, 4, 5, 0, 0, 7, 8, 9, 10, 11, 5], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 117], [117, 180], [180, 287], [287, 367], [367, 412], [412, 526], [526, 581], [581, 625], [625, 671], [671, 766], [766, 835], [835, 919], [919, 998], [998, 1108], [1108, 1176]]}