{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["One hot, sunny summer day kaylie and Rachel decided to take advantage of their day off and go to the beach.", "They headed to Old Orchard Beach in Maine.", "The sun was a big, yellow pellet blistering in the sky.", "They parked and say the clear crystal ocean water that faded into deep blue in the horizon.", "The beach was swarming with people.", "They observed people on white, yellow, orange, and pink towels while some were on chairs.", "Kaylie decided to lay on her towel on the beach and take a nap while Rachel went to swim in the sea.", "Before Rachel reached the water a little girl in a light purple swim suit with little yellow floats ran in front of her chased by a boy in green swim trunks.", "This reminded Rachel of going to the beach with her brothers.", "Before she got out of the water she saw four teenagers with paragliders.", "The day was perfect.", "All the daily stresses seemed to fade away.", "She came out of the water and joined kaylie on a towel on the sand."], "correspondences": [0, 1, 1, 2, 3, 4, 5, 7, 0, 10, 11, 12, 5], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 107], [107, 149], [149, 204], [204, 295], [295, 330], [330, 419], [419, 519], [519, 676], [676, 737], [737, 809], [809, 829], [829, 872], [872, 939]]}