{"source_units": ["It was a hot, sunny day and Kaylie and Rachel decided to take advantage of their off day and take a trip to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they were on their way to Old Orchard Beach in Maine.", "Once arriving and walking from the parking lot, they spotted the crystal clear water that faded into a deep blue on the horizon.", "The beach was swarming with people.", "Some on yellow, orange, white, and pink towels, while others were seen stretched out on lounge chairs with broad-brimmed hats shading their eyes from the rays of the sun.", "Children were decorating sandcastles with smooth, round seashells, and Kaylie decided to stretch out on her towel in the sand for a quick nap while Rachel went to cool off in the ocean.", "The sun shined on the water, causing it to look like a million little crystals.", "Just before making it to the surf, Rachel saw a little girl with freckles in a light purple bathing suit and little yellow floaties on her arms.", "The girl darted in front of Rachel, closely followed by a boy in green swimming shorts.", "Rachel smiled as she reminisced on memories of beach days with her brothers.", "After spending some time in the water, she looked up and saw four teenagers flying colorful paragliders.", "She thought to herself that the day was truly perfect, and all anxieties from her daily life were absent for a while.", "She closed her eyes for a few seconds to savor the moment before going to lie down next to Kaylie in the warm sand."], "response_units": ["It was a hot sunny day and Kaylie and Rachel decided to take advantage of the day and go to the beach.", "The sun was an optimistic yellow pellet, blistering in the sky as they made their way to Old Orchard Beach in Maine.", "Once they arrived in the parking lot, they spotted the crystal clear sky that faded into a nice deep blue in the sky.", "There were lots of people at the beach, in a variety of beach towels.", "Children were decorating, round, smooth seashells and Kaylie decided to take a nap on her towel and Rachel wanted to cool off in the ocean.", "Just before making it to the surf, Rachel saw a little girl with freckles in a purple bathing suit with yellow little floaties on her arm.", "The girl ran in front of Rachel, followed closely behind by a boy in green swim shorts.", "Rachel smiled as she thought of her own beach days wit her brothers.", "She spent some time on the water, looked up and saw 4 teens with colorful paragliders.", "She thought to herself how perfect the day had been and after a bit and how she'd gotten to forget all her worries and went to go join Kaylie."], "correspondences": [0, 1, 2, 3, 5, 7, 8, 9, 10, 11], "source_spans": [[0, 118], [118, 237], [237, 365], [365, 400], [400, 570], [570, 755], [755, 834], [834, 978], [978, 1065], [1065, 1141], [1141, 1245], [1245, 1362], [1362, 1477]], "response_spans": [[0, 102], [102, 218], [218, 335], [335, 404], [404, 543], [543, 681], [681, 768], [768, 836], [836, 922], [922, 1064]]}