{"source_units": ["One fine day an old Maine man was fishing ", "on his favorite lake ", "and catching very little", "Finally, he gave up", "and walked back along the shore to his fishing shack", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside", "There was a big black bear", "It was just pulling the cork out of his molasses jug with its teeth", "The molasses spilled all over the floor", "and the bear rubbed his paw in it, smearing it all over", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore", "Standing on its hind legs", "it held up the paw full of molasses", "Soon all the flies and bugs and mosquitoes were swarming", "all over the sticky sweet paw", "Then the bear waded into the water", "with his sticky paw full of bugs", "It held the paw out over the water", "Suddenly, a big trout came jumping out of the water trying to get to the flies", "The bear gave it a swat and it flew to the shore and flopped there", "Then another fish jumped into the air after the flies, followed swiftly by another", "Every time a fish jumped after his paw, the bear cuffed it ashore", "Soon it had a large pile", "The old man had caught nothing", "He watched that bear eat half a dozen trout", "his stomach rumbling", "All he had for dinner was some bread and what was left of the molasses", "Finally the bear paused in his eating", "and looked over to the bushes where the old man was hidden", "The bear stood up and laid the remaining fish in a row", "Then it walked away up the shore", "The old man crept out of the bushes and down to the shore", "Sure enough, the bear had left six large trout for him", "He looked over at the bear", "It was standing at the edge of the wood watching", "\"Thanks a lot,\" the old man called to the bear", "The bear waved the now-clean paw at the old man", "and disappeared into the thicket", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again"], "response_units": ["there was a fisherman who loved to fish on a lake in maine .", "he was not catching anything", "  when", "he saw something suspicious going on in his house", "he opens the door and sees a bear holding a jar of honey .", "  when the bear sees him he drops the jar and", "smears honey all over his paws", ". the bear then goes outside and", "waves his paws in the air", "  and", "bugs get caught in them", ". the", "bear goes to the river", "  and", "puts his paw near the water", "  and", "a trout jumps in to eat the bugs", "the bear then cuffs lots of fish to the side of the river", "the man is watching from behind a bush", "the bear gets out of the river and eats the fish but leaves 6 large trout for the fisherman .", "the bear then leaves and waves goodbye .", "  the fisherman gladly takes the fish and", "says he will never hunt bears again"], "correspondences": [-2, 2, -2, 6, -2, -2, 10, -2, 13, -2, 17, -2, 16, -2, 18, -2, 19, 22, 29, -2, -2, -2, 40], "source_spans": [[0, 42], [42, 63], [63, 87], [87, 106], [106, 158], [158, 214], [214, 291], [291, 317], [317, 384], [384, 423], [423, 478], [478, 584], [584, 609], [609, 644], [644, 700], [700, 729], [729, 763], [763, 795], [795, 829], [829, 907], [907, 973], [973, 1055], [1055, 1120], [1120, 1144], [1144, 1174], [1174, 1217], [1217, 1237], [1237, 1307], [1307, 1344], [1344, 1402], [1402, 1456], [1456, 1488], [1488, 1545], [1545, 1599], [1599, 1625], [1625, 1673], [1673, 1719], [1719, 1766], [1766, 1798], [1798, 1888], [1888, 1924]], "response_spans": [[0, 59], [60, 88], [88, 94], [94, 143], [145, 202], [202, 247], [247, 277], [277, 310], [310, 335], [162, 167], [340, 363], [277, 283], [369, 391], [162, 167], [396, 423], [162, 167], [428, 460], [462, 519], [521, 559], [561, 653], [654, 693], [693, 734], [734, 769]]}