{"source_units": ["One fine day an old Maine man was fishing ", "on his favorite lake ", "and catching very little", "Finally, he gave up", "and walked back along the shore to his fishing shack", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside", "There was a big black bear", "It was just pulling the cork out of his molasses jug with its teeth", "The molasses spilled all over the floor", "and the bear rubbed his paw in it, smearing it all over", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore", "Standing on its hind legs", "it held up the paw full of molasses", "Soon all the flies and bugs and mosquitoes were swarming", "all over the sticky sweet paw", "Then the bear waded into the water", "with his sticky paw full of bugs", "It held the paw out over the water", "Suddenly, a big trout came jumping out of the water trying to get to the flies", "The bear gave it a swat and it flew to the shore and flopped there", "Then another fish jumped into the air after the flies, followed swiftly by another", "Every time a fish jumped after his paw, the bear cuffed it ashore", "Soon it had a large pile", "The old man had caught nothing", "He watched that bear eat half a dozen trout", "his stomach rumbling", "All he had for dinner was some bread and what was left of the molasses", "Finally the bear paused in his eating", "and looked over to the bushes where the old man was hidden", "The bear stood up and laid the remaining fish in a row", "Then it walked away up the shore", "The old man crept out of the bushes and down to the shore", "Sure enough, the bear had left six large trout for him", "He looked over at the bear", "It was standing at the edge of the wood watching", "\"Thanks a lot,\" the old man called to the bear", "The bear waved the now-clean paw at the old man", "and disappeared into the thicket", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again"], "response_units": ["there was a fisherman fishing on", "his favorite lake", "  in maine . he was", "not having very much luck catching any fish", "he eventually gave up", "  and", "walked back to his fishing hut", "when he got closer he noticed that the door was open", ". when he looked in the door he saw a", "big black bear", "the bear knocked a jar of molasses down", "spread his big black paw through it on the ground", "the man screamed loudly and startled the bear who then ran down to the water", ". when he reached the water ,", "he put his sticky paw", "full of molasses in the air", "  and many", "bugs , flies , and mosquitoes", "became caught in the sticky goop", "he then put his paw on top of the water", "all of a sudden a giant fish jumped out towards the bugs on the paw and the bear swatted it towards the beach", ". he put his paw towards the surface of the water again and", "another big fish jumped out", "which he swatted towards the sandy beach . this happened again and again", "  until the bear had a dozen fish on the beach .", "he then walked towards his pile and began to eat them .", "the fisherman had walked towards the beach and hid behind a bush .", "  his", "stomach was grumbling", "  because he was so hungry .", "suddenly the bear noticed him hiding in the bushes .", "  he looked at him", "and then at his pile of fish . then he put the remaining fish in a line and started", "walking away down the beach and towards the forest", ". the fisherman went to the pile of fish and noticed that", "the bear had left him half a dozen", "he looked up towards the bear", "  who was", "looking at him from the opening into the forest", "he held up his now clean paw and waved", "the fisherman waved back .", "  he vowed to himself that he would never hunt a", "big black bear", "  again ."], "correspondences": [-2, 1, -2, 2, 3, -2, 4, 5, -2, 7, 9, 10, 11, -2, 15, 13, -2, 14, 17, 18, 20, -2, 21, 22, -2, -2, -2, -2, 26, -2, -2, -2, -2, 31, -2, 33, 34, -2, 35, 37, -2, -2, 7, -2], "source_spans": [[0, 42], [42, 63], [63, 87], [87, 106], [106, 158], [158, 214], [214, 291], [291, 317], [317, 384], [384, 423], [423, 478], [478, 584], [584, 609], [609, 644], [644, 700], [700, 729], [729, 763], [763, 795], [795, 829], [829, 907], [907, 973], [973, 1055], [1055, 1120], [1120, 1144], [1144, 1174], [1174, 1217], [1217, 1237], [1237, 1307], [1307, 1344], [1344, 1402], [1402, 1456], [1456, 1488], [1488, 1545], [1545, 1599], [1599, 1625], [1625, 1673], [1673, 1719], [1719, 1766], [1766, 1798], [1798, 1888], [1888, 1924]], "response_spans": [[0, 33], [33, 50], [50, 68], [68, 111], [113, 134], [134, 139], [139, 169], [171, 223], [223, 261], [261, 275], [277, 317], [321, 370], [372, 448], [448, 477], [477, 498], [499, 526], [526, 536], [536, 563], [564, 596], [598, 637], [639, 748], [748, 808], [808, 835], [837, 908], [908, 955], [955, 1009], [1010, 1075], [1075, 1080], [1080, 1101], [1101, 1128], [1128, 1179], [1179, 1197], [1197, 1280], [1280, 1330], [1330, 1388], [1388, 1422], [1424, 1453], [1453, 1462], [1462, 1509], [1511, 1549], [1551, 1576], [1576, 1624], [261, 275], [1638, 1645]]}