{"source_units": ["I was shopping at my local supermarket as I normally have for years.", "One particular day, I had done about 2 weeks’ worth of shopping and was headed toward the register to pay for my groceries.", "I reached into my back right pocket to grab the money to pay and noticed that there was no money in there.", "I started to get nervous.", "I knew my pocket book was in the car and I was sure I had put the money in my back right pocket.", "I look at cashier with a confused look, not knowing what to do.", "There were people behind me on the line and I immediately thought about the money I left in the car that was intended to pay rent this month.", "She told me to speak with the courtesy counter.", "I laughed and said, \"But it was cash, no one would hand that in!\"", "I decided that there was no harm in checking so I walked up to a women behind the counter and said \"I have to ask, did anyone turn in cash by any chance?\"", "She asked \"How much?\"", "My face then lit up.", "\"$200 in the form of twenty dollar bills.\"", "I replied.", "She said, \"Actually, yes, someone did!\"", "I was so surprised!", "\"Who?", "I want to thank them.\"", "She points to a young girl about 10 years old and says, \"She did.\"", "I walked over to the mom and hugged her.", "She said, \"It wasn't me, it was my daughter\".", "I was so happy, I was almost in tears.", "I decided in those moments to do my duty to pay forward this act of kindness every opportunity I had."], "response_units": ["One day, I went shopping the super market like I always did.", "I had gotten about 2 weeks' worth of groceries and I was in line at the checkout.", "As I got to the front of the line, I reached towards my back pocket, where I had put the money for groceries.", "I noticed that it was empty, and I got very nervous, thinking about the pocket book that was in the car.", "The money in the car was meant to pay this month's rent.", "I smiled at the cashier nervously, and she suggested I go to the courtesy counter.", "\"It was cash, though.", "Who would have turned that in?\"", "I figured I would give it a try so I walked up to the courtesy counter with no hope.", "\"Has anyone turned in cash to this counter?\"", "The woman responded, \"How much?\"", "My eyes widened as I gained hope that it might have been returned.", "\"$200 in twenties.\"", "The woman responded, \"Actually, yes.\"", "\"Who turned it in?", "I want to thank them!\"", "The woman pointed at a young girl.", "I went up to the mother and hugged her.", "\"It was my daughter.\"", "From that point on, I promised that if I had the chance I would pass the kindness on."], "correspondences": [0, 1, 4, 4, 6, 7, 8, 9, 9, 9, 10, 9, 12, 14, 8, 17, 18, 19, 20, 9], "source_spans": [[0, 68], [68, 191], [191, 297], [297, 322], [322, 418], [418, 481], [481, 622], [622, 669], [669, 734], [734, 888], [888, 909], [909, 929], [929, 971], [971, 981], [981, 1020], [1020, 1039], [1039, 1044], [1044, 1066], [1066, 1132], [1132, 1172], [1172, 1217], [1217, 1255], [1255, 1356]], "response_spans": [[0, 60], [60, 141], [141, 250], [250, 354], [354, 410], [410, 492], [492, 513], [513, 544], [544, 628], [628, 672], [672, 704], [704, 770], [770, 789], [789, 826], [826, 844], [844, 866], [866, 900], [900, 939], [939, 960], [960, 1045]]}