{"source_units": ["I was shopping at my local supermarket as I normally have for years.", "One particular day, I had done about 2 weeks’ worth of shopping and was headed toward the register to pay for my groceries.", "I reached into my back right pocket to grab the money to pay and noticed that there was no money in there.", "I started to get nervous.", "I knew my pocket book was in the car and I was sure I had put the money in my back right pocket.", "I look at cashier with a confused look, not knowing what to do.", "There were people behind me on the line and I immediately thought about the money I left in the car that was intended to pay rent this month.", "She told me to speak with the courtesy counter.", "I laughed and said, \"But it was cash, no one would hand that in!\"", "I decided that there was no harm in checking so I walked up to a women behind the counter and said \"I have to ask, did anyone turn in cash by any chance?\"", "She asked \"How much?\"", "My face then lit up.", "\"$200 in the form of twenty dollar bills.\"", "I replied.", "She said, \"Actually, yes, someone did!\"", "I was so surprised!", "\"Who?", "I want to thank them.\"", "She points to a young girl about 10 years old and says, \"She did.\"", "I walked over to the mom and hugged her.", "She said, \"It wasn't me, it was my daughter\".", "I was so happy, I was almost in tears.", "I decided in those moments to do my duty to pay forward this act of kindness every opportunity I had."], "response_units": ["I was shopping at my local grocery store and had done about 2 weeks worth of shopping.", "I went up to the register to pay and reached into my back right pocket for the money, when I noticed it wasn't there.", "I began to worry, because I knew I had put the money from my wallet into my back right pocket.", "I looked at the cashier, unsure of what to do.", "I thought immediately of the money in my wallet in my car which was supposed to go towards this month's rent.", "The cashier suggested I go to the front desk and ask if anyone had turned in any money.", "I laughed.", "\"But it was cash, no one would have turned that in!\"", "I decided there was no harm in checking, so I went up to a woman behind the counter and asked \"By any chance, did anyone turn in any money in cash?\"", "\"How much?\"", "she replied.", "My face then lit up.", "\"Two hundred in the form of twenty-dollar bills.\"", "\"Actually, someone did!\"", "She gave me my money.", "\"Who was it?\"", "I asked.", "\"I want to thank them.\"", "The woman pointed to a 10-year old girl behind me.", "\"She did.\"", "I went up to the mother and gave her a big hug.", "\"Actually, it was my daughter,\" she said.", "I was so grateful to the little girl, and now I pay that act of kindness forward whenever I can."], "correspondences": [0, 2, 4, 5, 6, 9, 13, 8, 9, 10, 14, 11, 12, 14, 20, 20, 13, 17, 18, 14, 19, 20, 22], "source_spans": [[0, 68], [68, 191], [191, 297], [297, 322], [322, 418], [418, 481], [481, 622], [622, 669], [669, 734], [734, 888], [888, 909], [909, 929], [929, 971], [971, 981], [981, 1020], [1020, 1039], [1039, 1044], [1044, 1066], [1066, 1132], [1132, 1172], [1172, 1217], [1217, 1255], [1255, 1356]], "response_spans": [[0, 86], [86, 203], [203, 297], [297, 343], [343, 452], [452, 539], [539, 549], [549, 601], [601, 749], [749, 760], [760, 772], [772, 792], [792, 841], [841, 865], [865, 886], [886, 899], [899, 907], [907, 930], [930, 980], [980, 990], [990, 1037], [1037, 1078], [1078, 1174]]}