{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["Everyday my cat Susie will sit outside on the deck, outside the kitchen window.", "She will then hit the window with her paw.", "Bang, bang.", "This means \"Feed me Ryan\" in her special language.", "I then feed her lunch.", "I think I know all there is to know about my cat Susie.", "For the life of me, I do not know where Susie goes at noon.", "One day, I notice that I cannot find Susie at 11:30.", "I go out into the neighborhood looking for her and see that she is out and about!", "I decide to follow her, and I see her walking on the sidewalk.", "She goes into an alleyway, and I think I know where Susie is going.", "Mr. Johnston's Fish Market backs up to this alleyway.", "I see Susie has met up with her cat colleagues .", "Mr. Johnston takes out a black trashbag to throw away, but also has with him a small, plastic back with fishheads inside of it.", "\"So, is this your cat?\"", "Mr. Johnston asks me in his thick Brooklyn accent.", "\"Yes, that's my Susie\" I say back to him.", "Mr. Johnston then tells me, \"I used to just throw away the fish heads, but then they would tear apart"], "correspondences": [0, 2, 1, 3, 4, 5, 6, 6, 12, 12, 5, 13, 14, 16, 25, 19, 27, 24], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 79], [79, 121], [121, 132], [132, 182], [182, 204], [204, 259], [259, 318], [318, 370], [370, 451], [451, 513], [513, 580], [580, 633], [633, 681], [681, 808], [808, 831], [831, 881], [881, 922], [922, 1023]]}