{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["At breakfast, my cat Susie sits on the deck of the pool outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means, \"Ryan, feed me\" in Susie's special language.", "I get up from the chair and feed her.", "I know this because I know everything about her, or at least I think I can.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty on Saturday morning, I notice that Susie is not at home.", "Where did she go?", "Then I see her trotting down the street towards town.", "I quickly follow.", "She goes down the block towards the traffic light.", "Then she passes the corner store and walks back behind the small strip mall.", "I suddenly think I know where she is going.", "Mr. Johnston's Fresh Fish Market is in a small white building at the back of the strip mall.", "I see Susie join her cat colleagues.", "A man comes out of the door to the fish store carrying several large black trash bags.", "He piles them into the dumpster.", "He then pulls out a small, clear plastic bag filled with fish heads.", "He scatters these around the ground and watches the cats pounce on them.", "He notices me lurking out of the corner of his eye.", "\"Hi, Ryan\" he says in his heavy Brooklyn accent.", "\"So this is where my Susie goes at noon\".", "\"Yep,\" he laughs, \"they come here everyday at noon.", "They used to tear up my trash so now I throw the fish heads to them.", "Is this your cat?\"", "Susie ignores me.", "The fish head is more interesting at that point.", "\"Yep, that's my Susie\".", "\"She's here everyday,\" he says before walking back inside.", "I wait for Susie to finish her fish head then we walk back towards home together."], "correspondences": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 5, 13, 14, 15, 16, 16, 17, 18, 19, 20, 6, 24, 25, 25, 26, 27, 28, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 95], [95, 106], [106, 137], [137, 193], [193, 230], [230, 305], [305, 364], [364, 437], [437, 454], [454, 507], [507, 524], [524, 574], [574, 650], [650, 693], [693, 785], [785, 821], [821, 907], [907, 939], [939, 1007], [1007, 1079], [1079, 1130], [1130, 1178], [1178, 1219], [1219, 1270], [1270, 1338], [1338, 1356], [1356, 1373], [1373, 1421], [1421, 1444], [1444, 1502], [1502, 1583]]}