{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["This guy had a cat named Susie and she pawed at the glass door to be let in for breakfast every morning.", "The guy knew everything about Susie except where she went at noon.", "One Saturday he noticed Susie was missing and quickly ran outside.", "He saw her darting down the road and decided to follow her.", "She went down a couple blocks and went past the corner store.", "He started to realize where she was going.", "There was a fish market at the end of the strip mall.", "Susie was joined by her cat colleagues.", "He followed Susie to the mall where the fish-man was discarding of the excess fish.", "He pulled out a clear bag full of fish heads and through them down to the cats.", "The man saw me watching the cats and called out in a thick accent \"Which ones yours?\"", "I pointed to Susie and the man said yup she is here everyday.", "Susie was too busy with the fish head to notice me.", "When she was done we walked home together."], "correspondences": [28, 6, 7, 9, 12, 8, 13, 14, 13, 16, 24, 6, 24, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 104], [104, 170], [170, 236], [236, 295], [295, 356], [356, 398], [398, 451], [451, 490], [490, 573], [573, 652], [652, 737], [737, 798], [798, 849], [849, 891]]}