{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["At breakfast, Susie sits outside by the pool.", "She taps twice on the glass door to the kitchen, and this means \"Ryan feed me\" in her special language.", "I know everything about Susie, or at least I think I do.", "For the life of me, I do not know where she goes everyday at noon.", "On Saturday morning at 11:30, I notice Susie is missing.", "I don't know where she could be, so I walk outside to look for her.", "I notice her walking down the street towards town, so I follow her.", "She passes the corner store and I see her headed for the strip mall.", "I think I know where she's going.", "Mr. Johnston's Fresh Fish Market is a white building at the back of the strip mall.", "Susie gets there and meets some of her cat colleagues.", "Mr. Johnston walks out the back of the store carrying a few black trash bags and puts them in the dumpster.", "Then he is carrying a small, clear white bag of fish heads.", "He spreads them out on the ground and the cats pounce on them.", "Mr. Johnston sees me lurking in the back and comes up and says \"Hi Ryan\".", "He asks if one of the cats is mine and I say, \"Susie is mine\".", "She is too busy eating the fish and is not interested in me.", "I tell him that \"I never knew where Susie is at noon\" and he tells me \"Susie is here everyday\".", "Mr. Johnston leaves and goes back into the store.", "I wait for Susie to finish eating so that we can walk home together."], "correspondences": [0, 24, 5, 6, 7, 5, 9, 12, 5, 13, 14, 15, 16, 17, 28, 6, 12, 6, 28, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 45], [45, 148], [148, 204], [204, 270], [270, 326], [326, 393], [393, 460], [460, 528], [528, 561], [561, 644], [644, 698], [698, 805], [805, 864], [864, 926], [926, 999], [999, 1061], [1061, 1121], [1121, 1216], [1216, 1265], [1265, 1333]]}