{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["I have a cat named Susie who stays outside and scratches at the back door everyday so I can feed her.", "We communicate great and I always feel like I know what she is thinking.", "However, everyday at noon Susie leaves and I have no idea where she goes.", "One day, I caught her walking off and decided to follow her down the sidewalk.", "As I walked behind her, we passed the stoplight and then behind the strip mall until we got to the back of Smiths fish market.", "Susie was greeted there by many of her other cat friends and they waiting until Mr. Smith came out the back door.", "He was holding a big black garbage bag which he emptied and then pulled  a clear plastic bag with fish heads out.", "He began to distribute the fish heads to all fo the cats.", "When he looked up and saw me I said \"so this is where susie goes everyday at noon\".", "He smiled and said in his thick Brooklyn accent that he was tired of them going through his trash so he thought this was a better idea.", "After that I never worried about where Susie went at noon."], "correspondences": [12, 5, 6, 12, 12, 14, 16, 24, 20, 12, 6], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 101], [101, 173], [173, 246], [246, 324], [324, 450], [450, 563], [563, 676], [676, 733], [733, 816], [816, 951], [951, 1009]]}