{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["She taps on the door and I let her in and feed her.", "It's her special Susie way of saying its time for me to feed her.", "I know this, because I know everything about her, or at least I think I do.", "I don't, for the life of me, know where Susie goes at noon.", "One Saturday morning I noticed Susie was home, and I saw that she had gone down the block.", "I quickly followed her as she crossed the traffic light and turned by the corner mall.", "I started to think I knew where she might be going.", "The Seafood Place is in a white brick building, behind the corner store.", "I saw that Susie along with thirty or so other cats was standing by the back door.", "Mr Johnson himself came out with a bunch of black trash bags and one small, clear one.", "He threw the trash in the dumpster then took out fish heads from the clear bag and scattered them on the ground.", "\"Hey, Ryan,\" he said, seeing me hiding behind the dumpster.", "\"so this is where Susie goes at noon,\" I laughed.", "\"They used to tear apart my trash bags, so now I just give the fish to them.", "One of them yours?\"", "he asked.", "\"Yup that's my Susie,\" I said.", "Susie doesn't reply- the fish head is more interesting than I am right now.", "\"She's here every Saturday!\"", "Susie and I walk back together."], "correspondences": [4, 24, 5, 6, 12, 11, 5, 13, 24, 15, 16, 12, 20, 24, 24, 8, 27, 5, 28, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 51], [51, 116], [116, 191], [191, 250], [250, 340], [340, 426], [426, 477], [477, 549], [549, 631], [631, 717], [717, 829], [829, 888], [888, 937], [937, 1013], [1013, 1032], [1032, 1041], [1041, 1071], [1071, 1146], [1146, 1174], [1174, 1205]]}