{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["At breakfast, my cat Susie lays by the pool outside the glass door.", "Thump, thump as she knocks on the door.", "That is saying \"Ryan, feed me.\"", "In her own special language.", "I know that because I know everything about Susie, or at least I think I do.", "For the life of me I do not know where Susie goes at noon.", "At 11:30 one morning I notice Susie s nowhere to be found.", "I wonder where might go and then see her walking down the street.", "I quickly follow her, as she turns a corner.", "Now she is walking back down the street.", "I have an idea where she may be heading.", "Mr. Johnston's fresh fish market was on the corner of the stripmall and sure enough that is where Susie was.", "Mr. Johnston took out a large black trashbag and threw it into the dumpster.", "Then he held out a smaller clear plastic bag full of fishheads.", "There were a number of cats around there.", "\"Hey Ryan,\" Mr. Johnston said in his thick Brooklyn accent, \"Hey Mr. Johnston\" I said.", "\"So this is where Susie is at noon\", \"Yep, all the cats come here at noon\" he replied.", "They used to tear up my trashbags so I just started to keep the fisheads out for them to sav"], "correspondences": [0, 2, 3, 3, 5, 6, 7, 12, 12, 9, 12, 13, 16, 16, 24, 19, 20, 24], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 67], [67, 106], [106, 137], [137, 165], [165, 241], [241, 299], [299, 357], [357, 422], [422, 466], [466, 506], [506, 546], [546, 654], [654, 730], [730, 793], [793, 834], [834, 920], [920, 1006], [1006, 1098]]}