{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["At breakfast time, Susie sits on the pool deck outside of the glass doors to the kitchen.", "Bang bang!", "She hits the glass with her paw.", "This means, \"Ryan, feed me\" in her special language.", "I know everything about Susie, or at least I think I do.", "For the life of me, I don't know where Susie goes at noon.", "At 11:30 on Saturday, I don't know where Susie is.", "I see her trotting around the corner towards town.", "I quickly follow her.", "She walks towards the traffic light and past the corner store.", "She begins to walk behind the strip mall I think I know where she is going.", "Mr. Johnston's Fish Market is a small white bulding in the corner of the strip mall.", "I see Susie walk up with her cat collegues to the back door of the store.", "Mr. Johnson comes out with several black trash bags and puts them in the dumpster.", "After putting them in the dumpster, he takes out a clear plastic bag full of fish heads.", "He scatters them on the floor for the cats and watches them pounce on them.", "He spots me lurking behind the corner and says \"Hi Ryan\" in his thick Brooklyn accent.", "I walk up to him.", "He says that the cats come here every day because he gives them fish heads because they used to tear up the garbage.", "He asks if one of the cats is mine.", "I say \"Yep, that's my Susie.\""], "correspondences": [0, 1, 2, 3, 5, 6, 6, 9, 10, 11, 12, 13, 12, 15, 16, 17, 19, 24, 24, 12, 27], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 89], [89, 99], [99, 131], [131, 183], [183, 239], [239, 297], [297, 347], [347, 397], [397, 418], [418, 480], [480, 555], [555, 639], [639, 712], [712, 794], [794, 882], [882, 957], [957, 1043], [1043, 1060], [1060, 1176], [1176, 1211], [1211, 1240]]}