{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["At breakfast my cat Susie is lounging on the pool deck.", "She hits the sliding glass door with her paws twice and this means \"Feed me Ryan\" in her special cat language.", "I know this because I know everything about Susie, or at least I think I do.", "For the life of me I cannot figure out where Susie goes everything afternoon.", "One Saturday afternoon I notice Susie is gone.", "I open the door and see her walking down the street towards town.", "I follow her and see her walk past the corner store.", "I have an idea of where she might be going.", "Johnston's fish market is in a black and white building.", "Susie walks behind the building where there are a dozen other cats.", "Mr. Johnston comes out with trash bags and throws them in the dumpster.", "He then pulls out a clear plastic bag with fish heads.", "He gives each cat a fish head.", "He notices me watching and calls out \"Hi Ryan, is this your cat?\"", "in a thick Brooklyn accent.", "\"Yes it is\" I reply.", "She comes here everyday.", "I wait for Susie to finish her fish head and we both walk home together."], "correspondences": [0, 2, 5, 6, 7, 9, 12, 5, 13, 12, 15, 16, 26, 12, 19, 5, 6, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 55], [55, 165], [165, 241], [241, 318], [318, 364], [364, 429], [429, 481], [481, 524], [524, 580], [580, 647], [647, 718], [718, 772], [772, 802], [802, 867], [867, 894], [894, 914], [914, 938], [938, 1010]]}