{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["I can understand the language of my cat as we have a great way of communicating.", "I am eating breakfast in the kitchen and she is outside, and I see her tap her paws on the glass kitchen door which means she is hungry.", "I feed her and I know everything that she does, except where she goes at noon.", "On Saturday around 11:30, I notice she disappears.", "I look outside and see her walking down the sidewalk so I follow her.", "She goes past the general store and I think I know where she is heading.", "We see a strip mall and in the back of the mall is a Fresh Fish Market.", "She goes around to the back of the Market behind the mall and I follow her.", "I see a bunch of other cats there and she is interacting with her cat colleagues.", "I then see the owner of the fish market come out with black trash bags to drop them in the dumpster.", "I also see him carrying a clear bag with fish heads, and he dumps it on the ground for all of the cats to eat.", "The owner then comes up to me and asks if one of the cats eating the fish was my cat.", "I reply that Susie was my cat and that I never knew where she went at noon.", "I try to talk to her but she is not listening as she is too concentrated on eating the fish.", "He replies that she is here every day.", "He used to dump all of the fish heads in the trash, but the cats would also rip open the bags and just eat the fish so now he puts them in a separate bag for the cats.", "He goes back inside and I wait for Susie to finish eating.", "We then walk down the street together back to our house."], "correspondences": [5, 12, 6, 12, 12, 12, 13, 12, 14, 24, 24, 24, 6, 24, 20, 24, 29, 24], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 80], [80, 216], [216, 294], [294, 344], [344, 413], [413, 485], [485, 556], [556, 631], [631, 712], [712, 812], [812, 922], [922, 1007], [1007, 1082], [1082, 1174], [1174, 1212], [1212, 1379], [1379, 1437], [1437, 1493]]}