{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["At breakfast, my cat Susie sits on the pool deck, near the glass door to the kitchen.", "Bang bang.", "She hits her paw on the door.", "This means \"feed me Ryan\" in her special Susie language.", "I get out of my chair and feed her.", "I know this because I know everything about her, or at least  I think I do.", "For the life of me, I don't know where Susie goes at noon.", "At eleven thirty on Saturday morning I notice that Susie is not home.", "I spy her trotting down the street towards down and quickly follow her.", "Susie turns the corner at the traffic light and goes past the corner store on the strip mall.", "I start to think that I know where she is going.", "Mr Johnston's Fresh Fish Market is in a small white building, behind the strip mall.", "I see that Susie is joined by several of her cat colleagues.", "Mr Johnston come out the back door carrying several black bags of garbage.", "He tosses them into the dumpster, then pulls out a small, clear plastic bag full of fishsheads.", "He scatters these on the ground and watches as the cats pounce on them.", "He spies me lurking by the corner.", "\"Hi Ryan,\" he calls out in his thick Brooklyn accent.", "\"So this is where Susie comes at noon,\" I say.", "\"All the cats come here at noon.", "They used to tear apart my garbage, so now I just put the fish heads on the ground for them.", "Is this her?\"", "\"That's my Susie\".", "Susie ignores me.", "The fish head is more interesting right now.", "\"She's here every day at noon.\"", "I wait until Susie is done with her fish head, then we walk home together."], "correspondences": [0, 1, 2, 3, 4, 5, 6, 7, 9, 11, 5, 13, 14, 15, 16, 17, 18, 19, 20, 23, 24, 20, 27, 25, 26, 7, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 85], [85, 95], [95, 124], [124, 180], [180, 215], [215, 290], [290, 348], [348, 417], [417, 488], [488, 581], [581, 629], [629, 713], [713, 773], [773, 847], [847, 942], [942, 1013], [1013, 1047], [1047, 1100], [1100, 1146], [1146, 1178], [1178, 1270], [1270, 1283], [1283, 1301], [1301, 1318], [1318, 1362], [1362, 1393], [1393, 1467]]}