{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["At breakfast, my cat Susie is sitting out on the deck by the pool.", "I hear her paw at the door.", "Bang, bang.", "Susie is telling me she is hungry in her own language.", "I know this because I know everything about Susie.", "Or at least, I think I do.", "For the life of my, I  have no idea where she goes at noon every day.", "On Saturday morning, at 11:30, I look out the door and see Susie trotting down the street.", "I have no idea where she is going so I decide to follow her.", "She goes to the end of the street where she meets some of her other cat friends.", "She then goes to the center of town to the Mr. Johnston's restaurant with her friends.", "I peak around the corner and see him throwing fish heads onto the ground for the group of cats to start eating.", "I walk up to Mr. Johnston, who says, \"Hi Ryan.\"", "\"So this is where Susie goes every day at noon?\"", "He asks, \"One of these is yours?", "Which one is Susie?\""], "correspondences": [0, 2, 1, 3, 5, 5, 6, 9, 5, 12, 28, 24, 28, 20, 6, 20], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 66], [66, 93], [93, 104], [104, 158], [158, 208], [208, 234], [234, 303], [303, 393], [393, 453], [453, 533], [533, 619], [619, 730], [730, 777], [777, 825], [825, 857], [857, 877]]}