{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["Every day I watch my cat Susie as she taps on the glass door with her paw after breakfast on the back deck.", "I think I know what she is thinking, since we've been together for many years.", "However, I still do not know where she goes every day at noon.", "One time I decide to follow her, and she begins by trotting down the street toward the traffic light until she reaches a strip mall down the road.", "Eventually, she joins her cat colleagues outside Johnston's Fresh Fish Market.", "Mr. Johnston empties several large black garbage bags of cut fish heads on the ground and watched the cats pounce on them.", "After noticing me lurking in the shadows, Mr. Johnston calls out \"Yes Ryan, this is where Susie comes every day at noon.\"", "Susie does not acknowledge me; apparently she is too busy devouring her meal.", "I then wait for Susie to finish her fish head and we subsequently walk back home together down the main street from the strip mall location."], "correspondences": [0, 5, 6, 9, 14, 16, 20, 6, 12], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 107], [107, 185], [185, 247], [247, 393], [393, 471], [471, 593], [593, 714], [714, 791], [791, 931]]}