{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["Susie lounges on the deck of our pool.", "Bang, bang.", "She hits the screen door with her paw.", "This means \"Feed me, Mark.\"", "I get up and get Susie her food.", "I know this because I know everything about Susie.", "Well, almost.", "For the life of me I cannot figure out where Susie goes at noon.", "It is 11:30 and I notice that Susie is not at home.", "Then I spot her wandering down the street.", "I quickly follow her as she heads downtown.", "She rounds the corner at the stoplight and goes past the corner store as she heads to the strip mall.", "I begin to think that I know where Susie is going.", "Mr. Johnston's Fresh Fish Market is a white building behind the strip mall.", "Many cats have gathered near the back door, and I can see Susie has joined her colleagues.", "Mr. Johnston comes out the back door with several bags of trash.", "He throws these in the garbage, then pulls out a clear bag with fish heads in it and throws them on the ground, watching the cats pounce on them.", "He sees me lurking.", "\"Hello, Mark,\" he calls.", "I walk toward him.", "\"So this is where Susie goes at noon,\" I say.", "He laughs.", "\"Yes, the cats used to tear up my garbage, so now I give them the fish heads separately.", "Is that your Susie?\"", "He points.", "She is more interested in the fish head than me.", "\"Yes, that's her,\" I say.", "He nods.", "\"She's here everyday.\"", "I wait for Susie to finish her fish head and we walk home together."], "correspondences": [0, 1, 2, 3, 4, 5, 24, 6, 20, 9, 12, 12, 5, 13, 14, 15, 24, 5, 28, 20, 20, 21, 24, 25, 12, 26, 27, 8, 28, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 38], [38, 49], [49, 87], [87, 114], [114, 146], [146, 196], [196, 209], [209, 273], [273, 324], [324, 366], [366, 409], [409, 510], [510, 560], [560, 635], [635, 725], [725, 789], [789, 934], [934, 953], [953, 977], [977, 995], [995, 1040], [1040, 1050], [1050, 1138], [1138, 1158], [1158, 1168], [1168, 1216], [1216, 1241], [1241, 1249], [1249, 1271], [1271, 1338]]}