{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["There was a man who loved his cat very dearly.", "This man fed his cat, Susie, every day, and thought he knew everything about her.", "However, one thing he didn't know was where she would disappear to each day at noon.", "So, one day he saw her walking towards town, and he decided to follow her.", "He had no idea on earth where she could possibly be going.", "Soon, though, her destination became clear.", "They were headed to a fish market.", "The man knew the owner of the fish market.", "When they arrived at the fish market, Susie met up with the other neighborhood cats and together they waited by a dumpster.", "The back door to the fish market opened, and out came the owner.", "He threw away a large black garbage bag and pulled out a clear plastic bag filled with fish heads.", "He gave these fish heads to the cats, who swarmed around the meal enthusiastically.", "The owner looked over and saw Susie's owner.", "He walked over to him and told him how he used to throw away the fish heads in the garbage each day, but he realized the cats wouldn't stop getting into his dumpster to eat the fish.", "So, he decided to just start saving them the leftover fish heads each day.", "Susie's owner was happy, because he'd finally figured out where Susie had been disappearing to at noon each day.", "He waited until she had finished up her meal, then together they walked back home."], "correspondences": [14, 14, 6, 9, 24, 8, 24, 13, 24, 13, 16, 24, 14, 24, 24, 6, 29], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 46], [46, 127], [127, 211], [211, 285], [285, 343], [343, 386], [386, 420], [420, 462], [462, 585], [585, 649], [649, 747], [747, 830], [830, 874], [874, 1056], [1056, 1130], [1130, 1242], [1242, 1324]]}