{"source_units": ["     At breakfast, my cat Susie sits on the deck of the pool, outside the glass doors to the kitchen.", "Bang, bang.", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.", "I get up from my chair and feed her.", "I know this, because I know everything about her, or at least I think I do.", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, I notice Susie is not at home.", "Where did she go?", "Then I spot her trotting down the street towards town.", "I quickly follow.", "Susie has turned the corner and is walking down the block towards the traffic light.", "She passes the corner store and walks behind the small strip mall, and I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.", "I see that Susie has joined several of her cat colleagues.", "Mr. Johnston comes out of the back door, carrying several black trash bags.", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.", "He scatters these on the ground and watches the cats pounce on them.", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent.", "“So this is where Susie comes at noon,” I say, walking towards him.", "Mr. Johnston laughs.", "“Yep.", "All the cats come to visit me at noon.", "They used to tear up my garbage, so now I just put the fish heads on the ground for them.", "Is that your cat?” Susie ignores me.", "The fish head is more interesting at the moment.", "“Yes, that’s my Susie,” I say.", "“She’s here every day,” says Mr. Johnston before walking back inside the store.", "I wait until Susie finishes her fish head, and we walk home together."], "response_units": ["I thought I knew everything about my cat, Suzie.", "Everything except where she goes at noon.", "One day, curiosity had gotten the best of me (like my cat),  and I followed Suzie leaving the house around 11 am.", "She led me through the neighborhood and into town, turning at the end of a shopping center.", "I intuited that she was going to Sal's Fish Market.", "There she was at the back door, and within a minute, Sal himself exited through the building with a clear bag of fish heads.", "Cats came from all around.", "He spread the fish thoroughly as the cats chomped down.", "Seeing me, he replied, \"It keeps them out of my trash.", "They tended to tear it up before I started doing this.\"", "After eating her heart's content, Suzie joined me and we walked in stride back home."], "correspondences": [5, 20, 12, 12, 5, 16, 23, 24, 5, 24, 28], "source_spans": [[0, 101], [101, 112], [112, 143], [143, 198], [198, 234], [234, 309], [309, 368], [368, 433], [433, 450], [450, 504], [504, 521], [521, 605], [605, 724], [724, 817], [817, 875], [875, 950], [950, 1048], [1048, 1116], [1116, 1168], [1168, 1217], [1217, 1284], [1284, 1304], [1304, 1309], [1309, 1347], [1347, 1436], [1436, 1472], [1472, 1520], [1520, 1550], [1550, 1629], [1629, 1698]], "response_spans": [[0, 48], [48, 89], [89, 202], [202, 293], [293, 344], [344, 468], [468, 494], [494, 549], [549, 603], [603, 658], [658, 742]]}