{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream that he could fly.", "The problem was, Larry's vision was poor, so he was unfit to be a pilot.", "Many people, faced with similar issues, might let go of their dream.", "But, Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift plane.", "It consisted of a lawn chair, seat belt, and about 40 something balloons.", "He had a pellet gun, CB radio, and cooler full of sandwiches, and he released the line from his Jeep, and rose 30 feet in the air.", "He was having a little picnic.", "He had planned to just shoot out a few balloons and float back to earth.", "However, Larry was not good at physics.", "The moment he released the tether, he flew about 15,000 feet in the air.", "He didn't shoot the balloons because otherwise the chair would tip.", "Larry drifted Long Beach airport and disrupted traffic.", "He wondered what he must look like to others: a man in a lawn chair with a gun.", "He finally landed and once he did he was immediately arrested for flying into restricted airspace.", "He was all over the papers.", "One reporter asked him why he did and Larry responded, \"A man can't just sit around.\""], "correspondences": [0, 1, 2, 3, 4, 4, 5, 5, 6, 7, 8, 9, 10, 11, 15, 15, 16], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 44], [44, 116], [116, 184], [184, 223], [223, 323], [323, 396], [396, 526], [526, 556], [556, 628], [628, 667], [667, 739], [739, 806], [806, 861], [861, 940], [940, 1038], [1038, 1065], [1065, 1150]]}