{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream that he could fly.", "The problem was that his vision was poor and he was thus ill- suited to become a pilot.", "Most people, faced with such limitations, might just let that dream go.", "Larry Walters was not most people.", "One sunny day in 1982 in his modest San Pedro home, Larry constructed an aircraft compromised of a lawn chair, a seatbelt and forty- odd weather balloons.", "Armed only with a pellet gun, a CB radio and a cooler full of sandwiches, he cut the line that tethered his craft to his Jeep.", "The craft rose to about thirty feet, and Larry had himself a nice little picnic.", "He planned to shoot a couple of the balloons and float back down the earthy, just as easy as can be.", "The problem was that Larry was not so good with physics, and his aircraft quickly rose to 15,000 feet.", "Scared to shoot any of the balloons for fear that he might tip, Larry eventually floated into the Long Beach Airport area.", "Imagine for a second what that must have looked like.", "He did eventually drift back down to earth, but not before getting tangled in some power lines and taking out the power for the entire Long Beach area.", "Needless to say, upon touching back down, Larry was immediately arrested.", "It seemed that FAA had not taken kindly to his flying in unregulated airspace.", "But the story had taken off, an there were a few crack reporters on the scene was he was arrested.", "One asked why he did it.", "Larry's response?", "\"A man can't just sit around\""], "correspondences": [0, 1, 2, 3, 4, 5, 5, 6, 1, 9, 11, 12, 13, 14, 15, 16, 17, 18], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 44], [44, 131], [131, 202], [202, 236], [236, 390], [390, 516], [516, 596], [596, 696], [696, 798], [798, 920], [920, 973], [973, 1124], [1124, 1197], [1197, 1275], [1275, 1373], [1373, 1397], [1397, 1414], [1414, 1443]]}