{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["There was once a man who wanted to be a pilot but had really bad eyesight.", "He decided to take matters into his own hands and make a makeshift aircraft.", "He used a radio, lawn chair, 40 weather balloons, and a basket to make his craft.", "He was going to float about 10 feet into the air and then use his shot gun to slowly take down balloons and drift safely back to earth.", "Instead he wasn't good at physics and drifted much higher into the air and caused air traffic.", "Imagine seeing a man sitting on a lawn chair with a shotgun while you're inside an airplane!", "Eventually he did drift down and got caught in a cable wire.", "He was afraid to shoot out the balloons because he thought the lawn chair would tip.", "Needless to say he was arrested on the spot.", "When reporters asked him why he did it he said a man cant just sit around."], "correspondences": [1, 5, 5, 6, 12, 11, 12, 9, 15, 16], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 74], [74, 150], [150, 231], [231, 366], [366, 460], [460, 552], [552, 612], [612, 696], [696, 740], [740, 814]]}