{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry walter's had a dream that he could fly.", "Though Larry had poor vision, which made him ill suited to be a pilot.", "Most people would give up on this dream if faced with similar limitations.", "However, larry wasn't most people.", "One sunny summer day in 1982 while in his san pedro backyard he decided to make a makeshift aircraft.", "It consisted of a lawn chair, a seatbelt, and 40 odd weather balloons.", "He was armed with a pellet gun, a CB radio, and a cooler of sandwiches.", "He tethered to his jeep and floated 40 feet in the air.", "Turns out his physics weren't very good and he was 15,000 feet in the air.", "He ended up drifting into the approach side of the long beach airport.", "He disrupted air traffic.", "Once he finally came down he got tangled into some power lines and cut off power for all of long beach.", "The FAA took umbrage with what he had done and he was arrested.", "A few crack reporters heard and asked why he did it.", "He replied, \"a man can't just sit around.\""], "correspondences": [0, 1, 2, 3, 4, 4, 5, 8, 12, 10, 10, 12, 15, 16, 18], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 45], [45, 115], [115, 189], [189, 223], [223, 324], [324, 394], [394, 465], [465, 520], [520, 594], [594, 664], [664, 689], [689, 792], [792, 855], [855, 907], [907, 949]]}