{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream that he could fly.", "Unfortunately, Larry had very poor vision, which made him ill-suited to pursue this dream.", "Most people in Larry's position would just give up, but Larry wasn't most people.", "Larry pursued his dream of flight in his own makeshift vehicle.", "In his own backyard, he used a lawn chair, a seatbelt, and 40-some odd weather balloons to try to pursue his dream of flying.", "One day, he decided to take off and have himself a picnic in the air.", "The plan was that he would release the tether from his Jeep and float a few hundred feet above the ground and enjoy himself a nice picnic.", "When he was ready to come down, he would shoot a couple of weather balloons and float safely back to the ground.", "Unfortunately, Larry wasn't that good at physics.", "Instead of floating a few hundred feet above, he went 15,000 feet into the air.", "He floated right into the approach for the Long Beach airport.", "Imagine if you were a passenger on this plan, and you saw Larry floating in his balloon lawn chair with a gun in his hand.", "What a sight!", "Larry couldn't shoot the balloons because he was afraid the chair would tip.", "The FAA was not too happy with Larry and had him arrested.", "When they asked him why he did it, he said \"A man can't just sit around!\""], "correspondences": [0, 1, 7, 5, 5, 11, 5, 6, 7, 8, 12, 11, 11, 9, 15, 16], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 44], [44, 134], [134, 215], [215, 278], [278, 403], [403, 472], [472, 610], [610, 722], [722, 771], [771, 850], [850, 912], [912, 1034], [1034, 1047], [1047, 1123], [1123, 1181], [1181, 1254]]}