{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream that he could fly.", "However, Larry had poor vision which made him ill-suited to be a pilot.", "Most people with that kind of limitation would let go of the dream.", "Larry was not most people.", "On a sunny summer day in 1982, Larry boarded a self-made aircraft in his modest backyard in San Pedro.", "This aircraft was made of a lawn-chair and forty-some odd balloons.", "Armed with a CB radio, a pellet gun, and a cooler full of sandwiches, Larry tethered himself to his Jeep and wanted to have himself a picnic about thirty or fourty feet in the air.", "He thought he would shoot a couple balloons to bring him back to the ground.", "However, Larry wasn't good at physics.", "When he released the tether, he floated up 15,000 feet.", "He didn't dare shoot out balloons because he was afraid the lawn chair would tip over.", "He floated over to the Long Beach airport corridor.", "Can you imagine what he looked like to a bunch of passengers waiting to land: a man in a lawn chair with a gun floating three miles above the Earth?", "He eventually came down, but not before getting tangled in electrical wires, and he knocked out power in the whole Long Beach area.", "When Larry got on the ground, he was arrested.", "FAA was upset with"], "correspondences": [0, 1, 2, 3, 4, 5, 5, 6, 7, 8, 9, 10, 11, 12, 15, 1], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 44], [44, 115], [115, 182], [182, 208], [208, 310], [310, 377], [377, 557], [557, 633], [633, 671], [671, 726], [726, 812], [812, 863], [863, 1011], [1011, 1142], [1142, 1188], [1188, 1206]]}