{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill- suited to become a pilot.", "Most people, faced with such limitations, might just let that dream go.", "Larry Walters was not most people.", "One sunny summer day in 1982, in the modest backyard of his San Pedro home, Larry boarded an aircraft comprised of a lawn chair, a seatbelt, and forty- odd weather balloons.", "He released the line that tethered his craft to his Jeep, armed with a pellet gun, a CB radio, and a cooler full of sandwiches and had a little picnic.", "He planned to shoot out a few balloons, and float back to the earth just as easy as can be.", "It seems Larry was not so good with physics.", "His aircraft quickly rose to 15,000 feet.", "Some reports, said he was too scared to shoot any of the balloons for fear that he might tip.", "He eventually floated into the approach area of the Long Beach airport.", "Imagine for a second what that must have looked like for the folks who were awaiting clearance to land.", "A man armed with a gun floating some three miles in the air.", "He eventually did drift back down, but not before getting entangled in some power lines and taking out the power for the greater Long Beach area.", "Needless to say, upon touching down on earth, Larry was immediately arrested.", "It seems the FAA had taken umbrage with his flying into restricted airspace.", "But by that time the story had spread, and a few crack reporters were already on the ground when he was arrested.", "One asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "correspondences": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 5, 12, 13, 14, 15, 16, 17, 18], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 44], [44, 136], [136, 207], [207, 241], [241, 414], [414, 565], [565, 656], [656, 700], [700, 741], [741, 834], [834, 905], [905, 1008], [1008, 1068], [1068, 1213], [1213, 1290], [1290, 1366], [1366, 1479], [1479, 1506], [1506, 1523], [1523, 1553]]}