{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream that he could fly.", "Yet Larry had poor vision, and thus was ill-suited to become a pilot.", "Most people, faced with similar implications, would let their dream go.", "Larry was not most people.", "On a sunny summer day in 1982, Larry built a makeshift aircraft, made from a lawn chair, a seat belt, and thirty old weather balloons.", "Equipped with a pellet gun, a CB radio, and some sandwiches, Larry untethered the rope that he attached to his Jeep, and quickly rose thirty or fourty feet in the air.", "He expected to have lunch and then shoot a few balloons, lowering back down to Earth as easily as he could.", "But Larry was not good at physics.", "Instead he rose 15,000 ft in the air and drifted towards the long beach area.", "His story spread and some said that he was afraid to shoot any balloons in fear of rising further up.", "Eventually he made his way to the Long Beach Airport, where he got caught up in air traffic.", "Just imagine waiting for your flight and seeing a man in a lawn chair armed with a gun.", "Larry eventually made it down, getting caught in power lines on his way down.", "By the time he landed, as expected, he was arrested.", "The FAA was not okay with his violations against air control patterns.", "Some reports were there to see his arrest.", "Some asked him why he had done it, and he responded, \"a man can't just sit aorun"], "correspondences": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 12, 11, 12, 15, 14, 15, 16], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 44], [44, 113], [113, 184], [184, 210], [210, 344], [344, 511], [511, 618], [618, 652], [652, 729], [729, 830], [830, 922], [922, 1009], [1009, 1086], [1086, 1138], [1138, 1208], [1208, 1250], [1250, 1330]]}