{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters always had a dream he could fly.", "Sadly, his vision was too poor.", "This would deter most people, but not Larry Walters of San Pedro.", "He built a makeshift aircraft with a lawn chair, a pellet gun, and about forty weather balloons.", "With a leather belt and a CB radio, he figured he'd shoot out a couple balloons upon reaching 30 feet.", "Larry wasn't good with physics, and he found himself 15,000 feet in the air.", "He was in the restricted flight zone.", "He didn't shoot out one balloon out of fear the chair would tip.", "He eventually touched down safely, not before tangling up in power lines that knocked out all the power in the Long Beach area.", "He was arrested, as the police didn't take kindly to him in restricted airspace.", "Before he was arrested, the public had caught wind and reporters witnessed his arrest.", "He said to one, \"A man can't just sit around.\""], "correspondences": [0, 1, 3, 5, 5, 7, 1, 9, 12, 15, 15, 18], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 46], [46, 77], [77, 142], [142, 238], [238, 340], [340, 416], [416, 453], [453, 517], [517, 644], [644, 724], [724, 810], [810, 856]]}