{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream he could fly.", "The problem was he had poor vision.", "He wanted to become a pilot.", "Normally people with this condition give up on their dream.", "Not larry walters.", "One day Larry in his modest backyard decides to fly.", "He attaches 40 balloons to a lawn chair complete with a CB radio and a picnic basket full of sandwiches.", "His plan is to go a few feet above ground and then shoot out the balloons to gently float back down to the ground.", "It turns out Larry is not so good with physics.", "He drifts thousands of feet above the ground.", "He disrupts air traffic.", "Image being on a plane and seeing a man in a lawn chair 3 miles above the ground with a shot gun.", "Many wonder why he didn't just shoot out some balloons and land.", "It must have been a scary sight.", "He eventually drifts down but not after being caught in a power line and causing a power outage to the surrounding Long Bay Area.", "Needless to say he was arrested as soon as he landed.", "Reporters however had caught whiff of Larry and where following him around.", "When the police asked him why he did it he replied a man cant just sit around."], "correspondences": [0, 1, 1, 2, 3, 11, 5, 6, 7, 8, 10, 11, 9, 11, 12, 15, 15, 16], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 39], [39, 74], [74, 102], [102, 161], [161, 179], [179, 231], [231, 335], [335, 449], [449, 496], [496, 541], [541, 565], [565, 662], [662, 726], [726, 758], [758, 887], [887, 940], [940, 1015], [1015, 1093]]}