{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry was a man who dreamed of flying.", "The problem was that Larry had poor vision and was unable to become a pilot.", "Most people would let these dreams go in these circumstances but Larry did not.", "He was still determined.", "In his backyard in San Pedro, Larry constructed his own plan using a lawn chair and some 40 odd weather balloons.", "He packed himself a picnic of sandwiches in a cooler and strapped on his gun.", "He let the tie go so he began to elevate in the air.", "Larry's plan was to shot a couple of balloons when he was ready to land.", "He rose much higher than he expected, almost 3 miles above the ground, and was afraid that if he shot any balloons his chair might tip.", "He continued to float around and eventually drifted into the sky space over the Long Beach airport.", "This disrupted air traffic.", "Imagine the sight that planes waiting for landing clearance witnessed.", "Eventually, Larry did land after his balloons became tangled in some power lines which resulted in an outage in the whole community.", "He was arrested because the federal airway group didn't appreciate his stunt.", "When asked why he did it,"], "correspondences": [0, 1, 2, 1, 4, 5, 9, 1, 11, 10, 10, 11, 12, 15, 16], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 38], [38, 114], [114, 193], [193, 217], [217, 330], [330, 407], [407, 459], [459, 531], [531, 666], [666, 765], [765, 792], [792, 862], [862, 994], [994, 1071], [1071, 1096]]}