{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream that he could fly.", "But, Larry had poor vision which made him ill-suited to become a pilot.", "Many people, faced with similar limitations, may given up their dream.", "But Larry was not most people.", "One sunny day in the summer of 1982, Larry decided to make a makeshift plane.", "He boarded the object made of a lawn chair, seat belt, and 40-odd weather balloons.", "Armed with a CB pellet gun, a basket full of sandwiches, and a radio Larry undid the tether that held him to his Jeep.", "He rose about 30 feet or so and had himself a nice little picnic.", "Larry planned on shooting a couple of the balloons and landing as safe as could be.", "As it turns out, Larry was not good at physics.", "When he released the tether, he rose 15,000 feet in the air.", "According to reports, he did not dare shoot down any more balloons for fear that the chair would tip.", "He started to drift toward the Long Beach area and eventually hit the approach section of the Long Beach airport, disrupting air traffic.", "What a strange sight to see a man on a lawn chair with a gun three miles in the air.", "Eventually Larry landed down safe in Long Beach, but was not landed long when the police arrested him.", "Apparently the FAA had an umbrage with him interfering in air space.", "A multitude of reporters saw the arrest and one of them asked, \"why did you do it?\"", "Larry said, \"a man can't just sit still\"."], "correspondences": [0, 1, 2, 3, 11, 4, 5, 5, 11, 7, 8, 9, 10, 11, 12, 14, 16, 18], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 44], [44, 115], [115, 185], [185, 215], [215, 292], [292, 375], [375, 493], [493, 558], [558, 641], [641, 688], [688, 748], [748, 849], [849, 986], [986, 1070], [1070, 1172], [1172, 1240], [1240, 1323], [1323, 1364]]}