{"source_units": ["Larry Walters had a dream that he could fly.", "The problem was that Larry's vision was poor, and he was thus ill-suited to become a pilot.", "Most people, faced with similar limitations, might let go of such a dream.", "Larry Walters was not most people.", "On a sunny summer day in 1982, in his modest backyard in San Pedro, Larry boarded a makeshift aircraft comprising a lawn chair, a seat belt, and forty-odd weather balloons.", "Armed with a pellet gun, a CB radio, and a cooler full of sandwiches, he released the line that tethered his craft to his Jeep, rose to a height of thirty feet or so, and had himself a little picnic.", "He planned to just shoot out a couple balloons and float gently back to earth, just as easy as could be.", "But Larry, it would seem, was not so good with physics.", "When he released the tether, his craft rose 15,000 feet in the air.", "According to some reports, he didn't dare shoot out the balloons, for fear the chair would tip.", "Eventually, he drifted into the approach corridor of Long Beach airport, disrupting air traffic.", "Imagine for a moment what that must have looked like to the folks waiting for clearance to land: a man in a lawn chair with a gun, some three miles above the ground.", "He did finally touch down safely, though not before getting tangled in some power lines and knocking out power in the entire Long Beach area.", "It goes without saying that Larry, upon touchdown, was arrested.", "Seems the FAA took umbrage with his violation of restricted airspace.", "But by the time they nabbed him, the story had spread, and a few crack reporters witnessed his arrest.", "One of those reporters asked why he'd done it.", "Larry's response?", "\"A man can't just sit around.\""], "response_units": ["Larry Walters had a dream of flying.", "Unfortunately, he had poor vision, making him ill-fitted to being a pilot.", "Most people would have let go of this dream, but he was not one of them.", "Larry Walters made his dream a reality.", "In 1982 in his modest backyard in San Pedro, he made a makeshift flying machine out of a lawn chair, a seat belt and forty-some weather balloons.", "Armed with a CB, a pellet gun and a cooler of sandwiches, he tethered his contraption to his Jeep and flew about 30 feet in the air.", "Larry thought that he could just shoot down a few balloons when he was finished.", "Unfortunately, physics was not Larry's strong point.", "When he was ready to be finished, he untethered his line and flew 15,000 feet into the air.", "He rose high into the sky and found himself in the arrival space of the Long Beach Airport.", "Imagine how it must have been waiting on"], "correspondences": [0, 1, 2, 0, 4, 5, 6, 7, 8, 8, 16], "source_spans": [[0, 44], [44, 135], [135, 209], [209, 243], [243, 415], [415, 614], [614, 718], [718, 773], [773, 840], [840, 935], [935, 1031], [1031, 1196], [1196, 1337], [1337, 1401], [1401, 1470], [1470, 1572], [1572, 1618], [1618, 1635], [1635, 1665]], "response_spans": [[0, 36], [36, 110], [110, 182], [182, 221], [221, 366], [366, 498], [498, 578], [578, 630], [630, 721], [721, 812], [812, 852]]}