{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["at breakfast", "susie sits on the deck of the pool ,", "outside the glass door to the kitchen", "bang , bang", "she hits the door with her paw .", "this means \" ryan , feed me \" in susie 's special language .", "i get up out of my chair and feed her .", "i know this ,", "  because i know everything about susie", "at least i think i do .", "i do n't know for the life of me where susie goes at noon . \t\t", "at eleven thirty saturday morning ,", "i notice that susie is n't home .", "where is she ?", "the n", "i spot her trotting down the street towards town .", "i quickly follow .", "i see her turn the corner and walk down the block towards the traffic light .", "she passes the corner store and heads behind a small strip mall .", "i think i know where she 's going . \t\t", "mr. johnston 's fresh fish market is in a small white building behind the strip mall .", "i see several of susie 's cat colleagues have joined .", "mr. johnston comes out the back door , carrying several black trash bags .", "he throws them into the dumpster and pulls out a clear plastic bag of fish heads .", "he scatters the fish heads across the ground and watches the cats pounce on them .", "he spies me lurking around the corner .", "\" hey ryan \" he calls out in his thick brooklyn accent . \"", "so this is where susie goes at noon", "\" i reply .", "\" yes , all the cats come here at noon to eat .", "they used to"], "correspondences": [0, 2, 3, 4, -2, -2, -2, -2, -2, 9, -2, 11, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, 24, -2, -2, -2, -2, -2], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 12], [14, 50], [50, 87], [89, 99], [101, 132], [133, 188], [189, 227], [228, 240], [240, 278], [280, 303], [-1, 58], [362, 397], [397, 429], [429, 442], [443, 448], [449, 498], [499, 516], [517, 593], [594, 658], [-1, 34], [694, 778], [779, 831], [832, 904], [905, 986], [987, 1068], [1069, 1107], [1109, 1164], [1164, 1199], [1199, 1209], [1210, 1254], [1255, 1267]]}