{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["at breakfast ,", "susie sits on the ground and watches me eat .", "she taps her paw two times on the door", "that is her signal for communicating with me", "and she says \" ryan i am hungry \" .", "i feed her at about 10:30 in the morning .", "  i know everything that susie does ,", "or at least i think i do .", "for the life of me , i do not know what she does at noon .", "at around 11:30 in the morning , susie leaves the house and walks down the street .", "i follow her as she is walking towards the strip mall .", "there is a fish market at the back of the strip mall that she walks towards .  ", "susie joins all of her colleagues at the back of the fish market", "i see mr. johnston at the fish market , and he is taking out his trash .", "  he puts three black trash bags", "into the dumpster , and", "then spreads the heads of the fish out on the ground for the cats .", "the cats go crazy and eat all of the fish heads .", "  i talk to mr. johnston and", "he asks which cat is mine", "i point to susie and tell him that i never know where she is at noon .", "mr. johnston tells me that she is here everyday", "i try to talk to susie", "  but", "she is too focused on the fish head that", "she does n't pay attention to me .", "i wait for susie to finish eating", "  and", "then we walk down the street back to my house together ."], "correspondences": [0, -2, 5, -2, -2, -2, 8, 9, 10, -2, -2, -2, 20, -2, -2, -2, 23, -2, -2, 31, -2, 35, -2, -2, 33, -2, -2, -2, 38], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 14], [14, 59], [59, 97], [99, 143], [144, 176], [177, 218], [218, 253], [254, 280], [280, 336], [338, 419], [420, 474], [475, 553], [553, 617], [619, 689], [689, 721], [721, 744], [744, 811], [813, 861], [861, 889], [889, 914], [916, 985], [986, 1033], [1035, 1057], [1057, 1062], [1062, 1103], [1103, 1136], [1136, 1169], [38, 43], [1174, 1229]]}