{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["at breakfast", "my cat susie", "sits on the deck of the pool", "outside the kitchen window", "bang , bang", "she hits the glass door with her paw .", "th", "is is her saying \" ryan feed me \" in her own special language .", "i know everything about susie", "at least i think i do", "i have no idea where she goes each day at noon .", "  one saturday morning", "i notice that susie is not at home .", "i spot her trotting down the street", "so i decide to follow her .", "she turns the corner and goes past the traffic light", "behind a white building heading towards the strip mall .", "i start to sense that i know where she is going .", "behind the strip mall is the back of mr. johnston 's fish market .", "susie has now met a group of her collegues and is sitting by the back door .", "mr. johnston comes out with a couple of large black garbage bags", "puts them in the dumpster . he then pulls out a clear plastic bag with fish heads in it", "spreads them on the floor .", "th", "e cats then begin eating them", "he spies me lurking around the corner", "and says \" hi ryan \" in his thick brooklyn accent .", "i said , \" so this is where susie comes everyday at noon \" .", "he laughed", "and said , \" that 's right .", "all the cats come to see me .", "th"], "correspondences": [0, 1, 2, 3, 4, -2, -2, -2, 8, 9, -2, -2, 12, -2, -2, 16, -2, -2, -2, -2, 21, 22, -2, -2, -2, 24, -2, -2, 27, -2, -2, -2], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 13], [13, 26], [26, 55], [55, 81], [83, 93], [95, 132], [133, 135], [135, 195], [196, 225], [227, 248], [250, 297], [297, 319], [319, 355], [355, 390], [391, 417], [418, 471], [471, 527], [527, 575], [576, 640], [641, 716], [717, 782], [786, 873], [877, 904], [133, 135], [906, 935], [937, 975], [975, 1024], [1024, 1080], [1081, 1092], [1092, 1117], [1117, 1145], [133, 135]]}