{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["one morning", "my cat susie", "was lounging on the pool cover next to the kitchen window .  ", "i could tell that she was waiting to be fed her breakfast .  ", "i know this because i know everything about susie", "well , almost everything .  ", "for the life of me i can not tell where she goes every afternoon .  ", "one saturday morning", "i noticed susie was missing", ".   i looked for her all over the house when i looked at the front window and", "saw her walking down the street towards town", "she was heading past the street light , past the pharmacy .  ", "i followed her and", "had a good idea of where she was going .  ", "she when around an alley next to johnson 's fish market .  ", "i watched as mr. johnson 's opened the door and", "through out a bag of trash .   then he opened a clear bag of fish heads", "started handing them out to the cats standing around him", "mr. johnson noticed me watching him", "and asked \" are any of these cats yours ?", "i nodded and pointed out to", "susie who was not remotely interested in me", "as she was busy eating her fish head", ".   mr johnson said \" they come every afternoon ,", "they use to tear up my trash", "until i started giving them the fish heads \" .  ", "with that he turned around went back inside .  ", "i waited for susie to finish her fish head", "then we walked home together ."], "correspondences": [-2, 1, -2, -2, 8, -2, -2, -2, 12, -2, 14, -2, -2, 18, -2, -2, 22, 23, 24, -2, -2, 32, 33, -2, 29, -2, 36, -2, 38], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 12], [12, 25], [25, 86], [86, 146], [146, 195], [198, 224], [224, 290], [290, 311], [311, 338], [338, 415], [415, 459], [462, 521], [521, 540], [540, 581], [581, 638], [638, 685], [685, 755], [759, 815], [818, 854], [854, 893], [896, 924], [924, 968], [968, 1004], [1004, 1051], [1051, 1080], [1080, 1126], [1126, 1172], [1172, 1214], [1219, 1248]]}