{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["at breakfast", "my cat susie", "sits on the deck by the edge of the pool", "just outside the glass doors .  ", "she paws at the glass doors", "bang , bang", "this means , \" ryan , feed me \" in her special language .  ", "i get up out of my chair to get food for her", "i know this because i know everything about her", "or so i think .", "  for the life of me , i do n't know where she goes at noon every day . \t\t\t\t it is 11:30 on saturday morning , and", "i see susie trotting down the street", "where is she going ?", "and so i decide to follow her .", "she turns the corner and heads toward town .", "she keeps going to the end of the street towards the traffic light .", "she joins some of her other cat friends as she continues closer towards town .", "i start to think i know where she is going", "mr. johnston 's fish market is part of a strip mall in the middle of town .", "i see mr. johnston come out with black garbage bags", "which he throws into the dumpster . i then see a clear plastic bag filled with fish heads ,", "which he dumps onto the ground .", "the cats pounce towards the fish heads .", "mr. johnston notices me lurking around the corner of the strip mall .", "\" hi ryan , \" he says .", "i say , \" so this is where susie goes \""], "correspondences": [0, 1, 2, 3, 5, 4, -2, 7, 8, -2, -2, 14, -2, -2, -2, -2, -2, 18, -2, 21, 22, -2, -2, 24, -2, -2], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 12], [14, 27], [27, 68], [68, 99], [99, 126], [128, 138], [140, 194], [194, 238], [240, 287], [289, 303], [-1, 108], [412, 448], [450, 469], [470, 500], [501, 544], [545, 612], [613, 690], [691, 733], [739, 812], [813, 865], [865, 955], [955, 987], [987, 1026], [1027, 1096], [1100, 1119], [1120, 1156]]}