{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["at breakfast", ", his cat susie", "sits at the glass door", "every morning .", "she taps on it", "which her owner , ryan , believes is her telling him she 's waiting for him to feed her .", "her owner thinks he knows everything about his cat susie", "and what she 's trying to say except where she goes everyday around noon . \t\t\t\t one day at 11:30 ,", "ryan notices susie has disappeared", "he finds her trotting down the road towards town", "he quickly gets up to follow her", "and find out where she is going .", "he follows her into town , behind the small strip mall and figures out where she 's going .", "there is a fish market at the back of the strip mall .", "as ryan turns the corner towards the fish market he spots susie joining some of her cat collegues at the back door .", "just then , the owner of the fish market opens the door .", "he takes out the trash and then pulls out a clear bag of fish heads ,", "dumping them onto the ground for the cats", "he notices ryan", "says hello in his brooklyn accent .", "he said the cats used to tear up his garbage", "so now he just gives them the fish heads every day at noon .", "he asks ryan if susie is his cat .", "ryan says yes and the man tells him susie comes there everyday at noon to eat his fish ."], "correspondences": [0, -2, 3, -2, 5, -2, 8, -2, 12, 14, 15, -2, -2, -2, -2, -2, 22, 23, 24, 25, -2, -2, -2, -2], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 12], [12, 28], [28, 51], [51, 66], [66, 81], [81, 167], [167, 224], [-1, 94], [319, 354], [358, 406], [408, 441], [441, 474], [474, 562], [563, 616], [617, 732], [733, 788], [789, 858], [858, 899], [901, 917], [921, 956], [956, 1000], [1001, 1060], [1061, 1094], [1095, 1182]]}