{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["at breakfast ,", "ryan 's cat susie", "sits at the pool deck", "outside of the back door .", "she taps on the door which means \" feed me ryan \" in her own special language .", "ryan thinks he knows everything about susie", "except he does not know where she goes everyday around noon .", "ryan notices", "  susie is gone", "around 11:30 one day and", "he spots her trotting down the street towards town", "he quickly gets up to follow her", ". he follows her to the red light ,", "past the corner store and toward the small strip mall . as he goes around the back of the strip mall", "he realizes she is heading to", "mr. johnston 's fresh fish market located in a small white building around the back of the strip mall .", "he sees susie join a group of her cat colleagues", "watches as mr . johnston appears from the back door", ", places the garbage bags in the trash and spreads the remaining clear bag of fish heads across the ground for the cats .", "he notices ryan lurking around the corner", "says hello in his brooklyn accent .", "ryan says \" so this is where susie goes everyday at noon \" .", "mr. johnston asks which cat is susie .", "she pays no attention to ryan", "he tells ryan she comes everyday", "before heading back .", "ryan waits for susie to finish eating"], "correspondences": [0, -2, 2, -2, -2, 8, -2, -2, -2, -2, 14, 15, -2, 17, 18, -2, 20, 21, -2, 24, 25, -2, -2, 32, 35, 36, -2], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 14], [14, 31], [31, 53], [53, 79], [79, 155], [156, 200], [200, 261], [261, 273], [273, 288], [288, 313], [313, 363], [365, 397], [397, 432], [432, 532], [532, 562], [562, 664], [664, 713], [717, 767], [767, 888], [888, 930], [934, 969], [969, 1026], [1027, 1064], [1065, 1094], [1096, 1129], [1129, 1150], [1150, 1187]]}