{"source_units": ["At breakfast, ", "my cat Susie", "sits on the deck of the pool", "outside the glass doors to the kitchen.  ", "Bang, bang.  ", "She hits the door with her paw.", "This means “Ryan, feed me” in Susie’s special language.  ", "I get up from my chair and feed her. ", "I know this, because I know everything about her", "or at least I think I do. ", "For the life of me, I do not know where Susie goes at noon.", "At eleven-thirty Saturday morning, ", "I notice Susie is not at home. ", "Where did she go? ", "Then I spot her trotting down the street towards town. ", "I quickly follow. ", "Susie has turned the corner and is walking down the block towards the traffic light. ", "She passes the corner store and walks behind the small strip mall, ", "I start thinking that I know where she is going.", "Mr. Johnston’s Fresh Fish Market is in a small, white building at the back of the strip mall.  ", "I see that Susie has joined several of her cat colleagues.  ", "Mr. Johnston comes out of the back door, carrying several black trash bags.  ", "He piles them into the dumpster, and then pulls out a small, clear plastic bag full of fish heads.  ", "He scatters these on the ground and watches the cats pounce on them.  ", "He spies me lurking by the corner of the strip mall.", "“Hi Ryan,” he calls in his thick Brooklyn accent. ", "“So this is where Susie comes at noon,” I say, walking towards him. ", "Mr. Johnston laughs.", "“Yep.  All the cats come to visit me at noon.  ", "They used to tear up my garbage, ", "so now I just put the fish heads on the ground for them. ", "Is that your cat?” ", "Susie ignores me.  ", "The fish head is more interesting at the moment. ", "“Yes, that’s my Susie,” I say. ", "“She’s here every day,” says Mr. Johnston ", "before walking back inside the store. ", "I wait until Susie finishes her fish head, ", "and we walk home together."], "response_units": ["on saturdays , susie likes to spend the mornings lounging by the pool in the sun .", "  the man who is her owner was eating", "breakfast", "  at the kitchen table when he heard", "bang bang bang", "on the glass door that led outside", ". that is susie 's indication that she wants", "breakfast", "he knows that because he knows everything about susie", "well almost everything .", "for the life of him , he does not know where susie goes at noon .", "\t\t around 1130 ,", "he notices that susie is nowhere to be found", "he goes out towards the street and sees her walking towards town .", "he decides to follow her to see where she goes at noon .", "she walked for a few blocks then came to a street light in town .", "she turned at the block that brings you to a small strip mall .", "when she got to the strip mall , she walked behind into the alleyway behind the stores .", "there were a bunch of cats behind the fish store ! \t\t", "then at noon , a man came out carrying a few large , black trash bags", "he heaved them up into the dumpster and then pulled a clear plastic bag out of his pocket that had fish heads in it", "he threw these heads to the cats .", "he then turned and saw the owner", ". he said hi and", "asked if this was his cat", "the owner said , \" yes that 's my susie ! \" .", "but susie ignored him", "she was too busy eating her fish head .", "he said , \" so this is where she goes at noon \" .", "the man said that the cats used to destroy his garbage", "so now he brings out fish heads so they eat that and not the garbage", "then he walked back inside the store .", "the owner waited for susie to finish her snack", "then they walked back together towards home ."], "correspondences": [-2, -2, 0, -2, 4, 3, -2, 0, 8, -2, 10, -2, 12, -2, -2, -2, -2, -2, -2, 21, 22, -2, 24, -2, 31, -2, 32, 33, -2, 29, 30, -2, -2, 38], "source_spans": [[0, 14], [14, 26], [26, 54], [54, 95], [95, 108], [108, 139], [139, 196], [196, 233], [233, 281], [281, 307], [307, 366], [366, 401], [401, 432], [432, 450], [450, 505], [505, 523], [523, 608], [608, 675], [675, 723], [723, 818], [818, 878], [878, 955], [955, 1055], [1055, 1125], [1125, 1177], [1177, 1227], [1227, 1295], [1295, 1315], [1315, 1362], [1362, 1395], [1395, 1452], [1452, 1471], [1471, 1490], [1490, 1539], [1539, 1570], [1570, 1612], [1612, 1650], [1650, 1693], [1693, 1719]], "response_spans": [[0, 80], [80, 117], [117, 126], [126, 162], [162, 176], [178, 212], [212, 256], [117, 126], [267, 320], [322, 345], [346, 410], [-1, 14], [425, 469], [471, 536], [537, 592], [593, 657], [658, 720], [721, 807], [-1, 51], [860, 927], [929, 1044], [1046, 1079], [1080, 1112], [1112, 1129], [1129, 1154], [1156, 1195], [1196, 1217], [1219, 1258], [1258, 1303], [1304, 1358], [1359, 1427], [1429, 1466], [1467, 1513], [1518, 1562]]}