{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["Once there was an old Maine man who liked to fish in a lake.", "One day, he had no luck at all with fishing and decided to give up and head back to his fishing shack.", "When he approached the shack however, he saw that the front door was open.", "When he looked inside, he saw a big black bear with the cork to his molasses jar in its teeth.", "The man yelled, startling the bear and causing it to spill the molasses all over the floor and smearing its paws in the mess.", "The bear ran out of the shack and towards the lake.", "It stood on the shore on its hind legs and soon a bunch of mosquitoes, flies, and other bugs swarmed around it molasses-covered paw.", "The bear waded into the lake with its paw outstretched over the surface, and suddenly, a large trout jumped out trying to eat the bugs on its paw.", "The bear swatted the fish aside onto the shore, and soon another trout followed and another until the bear had a big pile of fish.", "It ate half a dozen fish as the man watched from behind the bushes, his stomach growling for he had only had some bread and molasses that morning.", "The bear though lined up half a dozen trout on the shore before"], "correspondences": [0, 1, 2, 20, 6, 7, 8, 10, 21, 19, 21], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 60], [60, 162], [162, 236], [236, 330], [330, 455], [455, 506], [506, 638], [638, 784], [784, 914], [914, 1060], [1060, 1123]]}