{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["One fine day an old man was down by the lake fishing for trout.", "However, he was having no luck catching any.", "He returned to his fishing shack and saw that the door was open.", "Being a cautious old me he approached the shack slowly and peered through the door.", "Inside he saw a black bear holding a barrel of molasses.", "The bear was pulling the cork out of the barrel and the molasses was pouring onto the floor.", "The bear then rubbed his paws in the molasses.", "The old man yelled at the bear to get out and the bear was so startled it ran straight towards the lake shore.", "The old man had followed the bear and hid in a bush watching the bear.", "The bear stood up on two hind legs in the lake and held out his paw over the water where it attracted flies.", "Soon trout were jumping out of the water trying to catch the flies and each time the trout jumped out of the water the bear swatted the trout onto the shore.", "The bear then began to eat the trout.", "The old mans stomach was rumbling watching the bear eat the trout.", "All he had left at home to eat was some bread and the leftover molasses.", "The bear looked over at the bush the old man was hiding in and then walked away from his trout.", "The old man walked over to where the bear had been eating the trout and noticed that the bear had left him 6 trout.", "He yelled \"Thank you!\"", "to the bear who waved his now clean paw and went off into the woods.", "The man remarked to himself \"well this is the first time I've had a bear pay for my molasses\"."], "correspondences": [0, 19, 2, 3, 4, 5, 6, 7, 20, 11, 12, 12, 18, 19, 20, 24, 2, 7, 29], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 63], [63, 107], [107, 171], [171, 254], [254, 310], [310, 402], [402, 448], [448, 558], [558, 628], [628, 736], [736, 893], [893, 930], [930, 996], [996, 1068], [1068, 1163], [1163, 1278], [1278, 1300], [1300, 1368], [1368, 1462]]}