{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["A fisherman returned from fishing at the lake and not catching anything.", "Upon returning to his cabin he entered through the door and noticed a big black bear holding his molassas jar.", "The bear was wrestling with the jar and the top came off spilling the molassas on the floor and getting the sticky substance all over his paws.", "When the fisherman saw him he let out a \"yelp\" which startled the bear and sent him running out of the house towards the lake.", "The fisherman followed after him hiding in the bushes near the lake.", "The bear had the sticky mollassas all over his paws and bugs were starting to stick to his paw.", "As he was wading in the lake a trout jumped up to eat the bugs on his paw.", "The bear swatted the trout and it landed on the bank of the river.", "He repeated this a number of times until there were about a dozen trout laying on the river bank.", "The man was looking on from the bushes and amazed at how many trout the bear caught.", "His stomach started growling as he remembered how hungry he was.", "The bear ate half of the fish and then looking in the man's direction turned away and left the rest of them there.", "The man was"], "correspondences": [0, 20, 6, 7, 20, 6, 12, 13, 21, 20, 2, 20, 17], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 72], [72, 182], [182, 325], [325, 451], [451, 519], [519, 614], [614, 688], [688, 754], [754, 851], [851, 935], [935, 999], [999, 1113], [1113, 1124]]}