{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["Once there was a fisherman catching fish along the lake shore.", "The man caught nothing.", "As he was heading back to his fishing shed, he saw the door was open.", "Being the suspicious man that he was, he peered inside to see what was there.", "To his surprise, a big black bear was in his fishing shed.", "The bear found the man's molasses.", "He unscrewed the cork with his teeth and then spilled molasses everywhere.", "He wiped the floor with his paw, causing his paw to become sticky.", "When the man saw this, he screamed, and the bear was so startled that he started to run toward the lake shore.", "On his hind legs, he kept his paw in the air.", "Soon enough, flies started to swarm his paw to get to the sweet and sticky molasses.", "As flies swarmed his hand, fish tried to come up out of the water to eat the flies.", "Every time a fish would jump up, the bear would swat it away, making a pile of fish he had cuffed on the lakeshore.", "The man watched from the bushes in awe as the bear was eating half a dozen trout.", "His stomach rumbled, as he had nothing to eat for dinner except bread and some of that molasses.", "The bear looked over in the bushes at the man.", "Then, he left fish in a pile.", "The man walked over and sure enough, the bear had laid out 6 large trout in a line for him to eat.", "He looked over at the bear, who had gone to the other side of the shore.", "He thanked the bear, and the bear motioned over to him before running off.", "The man looked at the trout, and said, \"Wow.", "This is the first time a bear has ever paid me for molasses.\"", "He decided he would never hunt bears again."], "correspondences": [0, 17, 2, 3, 4, 29, 5, 10, 7, 8, 12, 12, 12, 20, 19, 20, 16, 24, 25, 7, 25, 29, 2], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 62], [62, 85], [85, 154], [154, 231], [231, 289], [289, 323], [323, 397], [397, 463], [463, 573], [573, 618], [618, 702], [702, 785], [785, 900], [900, 981], [981, 1077], [1077, 1123], [1123, 1152], [1152, 1250], [1250, 1322], [1322, 1396], [1396, 1440], [1440, 1501], [1501, 1544]]}