{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["One day a fisherman was out at sea attempting to catch some fish.", "He was having no luck so decided to go home.", "When he headed home, he noticed his front door was open.", "So he looked inside and saw a big black bear.", "It had it's paws on his jar of molasses.", "The bear dropped the jar and used his paw to scoop a big glob of molasses.", "The fisherman screamed and the bear was startled and ran outside.", "When it got onto the shore, flies and insects were attracted to its paw because of the sweet, sticky scent of the molasses.", "So, the bear ran into the water to avoid them.", "In the water, one fish jumped out of the water and tried to get at the bear's paw.", "So, the bear swiped at it, pushing it onto land, and killed it.", "This happened for several more fish.", "Soon, the bear had a good sized pile of dead fish.", "So, while the fisherman looked on from the shadows, the bear began to eat the fish.", "Before it finished, however, it looked at the fisherman and rearranged the remaining fish into a straight line, and went up the shore.", "The fisherman came close to the fish and remarked how he had never been had a bear pay him for eating his molasses.", "The bear saw the fisherman with the fish, waved a paw at him, then retreated."], "correspondences": [12, 2, 2, 4, 5, 10, 7, 12, 12, 12, 13, 24, 21, 20, 21, 29, 28], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 65], [65, 109], [109, 165], [165, 210], [210, 250], [250, 324], [324, 389], [389, 512], [512, 558], [558, 640], [640, 703], [703, 739], [739, 789], [789, 872], [872, 1006], [1006, 1121], [1121, 1198]]}