{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["One fine day a Maine fisherman was fishing at the lake, with little luck.", "Giving up, he went to his home and found his door open.", "Being of a suspicious nature, he looked into the open door and found a big black bear inside.", "The bear had a jar of molasses in his paw.", "It was uncorking the jar with it's teeth.", "As the jar was opened, the bear thrust his paw into the jar, covering it with the sticky sweet molasses.", "The fisherman hid down near the river.", "The bear left the cabin and swung his giant paw into the air.", "From all around, flies, bugs and mosquitoes came to taste the sticky sweet solution on his paw.", "The bear then went into the river and continued to swing his paw about.", "Trout from the river leaped out of the water lured out by the insects, and the bear snatched them up with the his other paw.", "The fisherman watched from behind his bush.", "He was saddened by what he saw, only having a slice of bread to eat and what was left of the molasses.", "When the bear had finished catching the trout, he laid 6 on the side of the river."], "correspondences": [0, 2, 3, 6, 5, 6, 23, 28, 9, 7, 12, 20, 19, 21], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 73], [73, 128], [128, 221], [221, 263], [263, 304], [304, 408], [408, 446], [446, 507], [507, 602], [602, 673], [673, 797], [797, 840], [840, 942], [942, 1024]]}