{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["One fine day an old Maine man was fishing at his favorite lake and catching very little.", "So, he went back to his fishing shack.", "Once he got there, he noticed the front door was open.", "Because he had a suspicious nature, he quietly went to the door and looked inside.", "There was a big black bear.", "It was pulling the cork out of his molasses.", "The molasses spilled all over the ground and the bear placed its paw in it, covering his paw with it.", "The old man screamed and the bear ran to the shore, frightened.", "On the shore, the bear's sticky sweet paw was being attacked by flies and bugs that wanted to eat the molasses on his paw.", "The bear got in the water, with his paw raised over the water.", "Suddenly, a trout leapt out of the water, trying to get at the bear's paw.", "The bear slapped the trout onto the shore, killing it.", "Soon, more trout were doing the same thing, and all were slapped onto the shore.", "Before long there was a large pile of dead fish.", "The bear began to eat the fish, as the old fisherman looked on, hungrily.", "He had been unable to catch a fish all day.", "The bear paused in its eating to look at the fisherman.", "It got up, laid the remaining fish in a line, and walked away.", "The fisherman came to the pile and saw that the bear had left him 6 large trout.", "The old man was very surprised, as this was the first time a bear had paid him for his molasses.", "The black bear looked on from the edge of the woods.", "The fisherman smiled at it and the black bear waved and disappeared.", "From that day on, the fisherman never hntec"], "correspondences": [0, 1, 2, 3, 4, 5, 6, 7, 20, 11, 12, 7, 13, 16, 20, 24, 20, 21, 24, 29, 26, 28, 29], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 88], [88, 126], [126, 180], [180, 262], [262, 289], [289, 333], [333, 434], [434, 497], [497, 619], [619, 681], [681, 755], [755, 809], [809, 889], [889, 937], [937, 1010], [1010, 1053], [1053, 1108], [1108, 1170], [1170, 1250], [1250, 1346], [1346, 1398], [1398, 1466], [1466, 1509]]}