{"source_units": ["One fine day an old Maine man was fishing on his favorite lake and catching very little.", "Finally, he gave up and walked back along the shore to his fishing shack.", "When he got close to the front door, he saw it was open.", "Being of a suspicious nature, he walked to the door quietly and looked inside.", "There was a big black bear.", "It was just pulling the cork out of his molasses jug with its teeth.", "The molasses spilled all over the floor and the bear rubbed his paw in it, smearing it all over.", "When the old man saw the bear, he screamed out loud causing the bear the startle and run to the lake shore.", "Standing on its hind legs, it held up the paw full of molasses.", "Soon all the flies and bugs and mosquitoes were swarming all over the sticky sweet paw.", "Then the bear waded into the water with his sticky paw full of bugs.", "It held the paw out over the water.", "Suddenly, a big trout came jumping out of the water trying to get to the flies.", "The bear gave it a swat and it flew to the shore and flopped there.", "Then another fish jumped into the air after the flies, followed swiftly by another.", "Every time a fish jumped after his paw, the bear cuffed it ashore.", "Soon it had a large pile.", "The old man had caught nothing.", "He watched that bear eat half a dozen trout, his stomach rumbling.", "All he had for dinner was some bread and what was left of the molasses.", "Finally the bear paused in his eating, and looked over to the bushes where the old man was hidden.", "The bear stood up and laid the remaining fish in a row.", "Then it walked away up the shore.", "The old man crept out of the bushes and down to the shore.", "Sure enough, the bear had left six large trout for him.", "He looked over at the bear.", "It was standing at the edge of the wood watching.", "\"Thanks a lot,\" the old man called to the bear.", "The bear waved the now-clean paw at the old man and disappeared into the thicket.", "\"Well,\" said the old man, \"That's the first time a bear has ever paid me for my molasses.\"", "The old man never hunted bears again."], "response_units": ["One fine day an old Maine man was fishing at his favorite lake and catching little.", "When he had had enough, he walked along the shore back to his cabin.", "As he approached the door he saw that it was open.", "Being of a suspicious nature the man peeked around the corner of the door.", "There he saw a big black bear.", "It had just put it's teeth into the cork of his molasses.", "Jug.", "The molasses spilled out onto the floor and the bear put his paw in it smearing it around.", "The man let out a shout as he saw the bear giving it the startle and causing it to run to the shore.", "It stood on its hind legs holding his sticky paw up into the air.", "Soon, the bugs and flies and mosquitoes came looking for the sticky sweet molasses.", "As the bear waded into the water holding his sticky paw full of bugs.", "Suddenly, a big trout jumped out of the water looking for the bugs.", "The bear quickly swatted it towards the shore.", "Then another trout came, and another, each being cuffed by the bear to the shore.", "The bear had a large pile of trout for himself.", "As the bear feasted on half a dozen trout the old man felt hungry, as he had caught little.", "All he had for dinner was some bread and what was left of the molasses, his stomach rumbling.", "Finally, the bear looked over to the bush where the old man was hiding.", "The bear stood up and sorted six fish in"], "correspondences": [0, 1, 2, 3, 4, 5, 5, 6, 7, 8, 9, 10, 12, 7, 7, 24, 24, 19, 20, 21], "source_spans": [[0, 88], [88, 161], [161, 217], [217, 295], [295, 322], [322, 390], [390, 486], [486, 593], [593, 656], [656, 743], [743, 811], [811, 846], [846, 925], [925, 992], [992, 1075], [1075, 1141], [1141, 1166], [1166, 1197], [1197, 1263], [1263, 1334], [1334, 1432], [1432, 1487], [1487, 1520], [1520, 1578], [1578, 1633], [1633, 1660], [1660, 1709], [1709, 1756], [1756, 1837], [1837, 1927], [1927, 1964]], "response_spans": [[0, 83], [83, 151], [151, 201], [201, 275], [275, 305], [305, 362], [362, 366], [366, 456], [456, 556], [556, 621], [621, 704], [704, 773], [773, 840], [840, 886], [886, 967], [967, 1014], [1014, 1105], [1105, 1198], [1198, 1269], [1269, 1309]]}