{"source_units": ["I was shopping at my local supermarket", "as I normally have for years.", "One particular day, I had done about 2 weeks’ worth of shopping", "and was headed toward the register to pay for my groceries.", "I reached into my back right pocket", "to grab the money to pay", "and noticed that there was no money in there.", "I started to get nervous.", "I knew my pocket book was in the car ", "and I was sure I had put the money in my back right pocket.", "I look at cashier with a confused look,", "not knowing what to do.", "There were people behind me on the line ", "and I immediately thought about the money I left in the car", "that was intended to pay rent this month.", "She told me to speak with the courtesy counter.", "I laughed and said,", "\"But it was cash, no one would hand that in!\"  ", "I decided that there was no harm in checking ", "so I walked up to a woman behind the counter ", "and said \"I have to ask, did anyone turn in cash by any chance?\"", "She asked \"How much?\"  ", "My face then lit up.", "\"$200 ", "in the form of twenty dollar bills.\" I replied.", "She said, \"Actually, yes, someone did!\"  ", "I was so surprised! ", "\"Who? I want to thank them.\"  ", "She points to a young girl ", "about 10 years old ", "and says, \"She did.\" ", "I walked over to the mom", "and hugged her.", "She said, \"It wasn't me, it was my daughter\". ", "I was so happy, ", "I was almost in tears. ", "I decided in those moments to do my duty ", "to pay forward this act of kindness ", "every opportunity I had."], "response_units": ["one day a lady went grocery shopping .", "  she 'd finished her grocery shopping and", "  was standing in line waiting to check out", "when she reached into her back pocket and realized her money was n't where she 'd placed it .", "she realized she was holding up the line of people behind her", "  but", "she had no idea what to do", "she remembered bringing her wallet into the car that morning", "and had stuck the money she 'd needed for grocery shopping in her back pocket of her jeans .", "the remaining money in the wallet", "was to pay for that month 's rent .", "she looked at the cashier , bewildered", "the cashier suggested that the lady visit the customer 's corner and see if anyone had turned in some missing money .", "  the lady was quite skeptical because she did n't believe anyone would be kind enough to turn in money they 'd found . \t\t\t\t\t\t", "however , when she got to the customer 's corner , she was in for a pleasant surprise .", "the worker behind the desk asked her how much she was missing", ". when the lady told her the exact amount ,", "the worker said that someone had actually turned in the cash", "the lady was ecstatic and could n't believe her luck .", "she asked the store worker who the person was so she could properly thank them .", "the worker pointed to a woman in the store .", "the lady went over to the woman", "and gave her a big head , but the woman told her that it was n't her doing , but rather , her young daughter 's . \t\t\t\t", "the lady thanked the daughter and from that day on vowed to treat others with the same kindness this little girl had treated her with"], "correspondences": [-2, -2, 3, -2, -2, -2, 11, 8, -2, 13, -2, 10, -2, -2, -2, 21, -2, 25, -2, -2, -2, 31, -2, 36], "source_spans": [[0, 38], [38, 67], [67, 130], [130, 189], [189, 224], [224, 248], [248, 293], [293, 318], [318, 355], [355, 414], [414, 453], [453, 476], [476, 516], [516, 575], [575, 616], [616, 663], [663, 682], [682, 729], [729, 774], [774, 819], [819, 883], [883, 906], [906, 926], [926, 932], [932, 979], [979, 1020], [1020, 1040], [1040, 1070], [1070, 1097], [1097, 1116], [1116, 1137], [1137, 1161], [1161, 1176], [1176, 1222], [1222, 1238], [1238, 1261], [1261, 1302], [1302, 1338], [1338, 1362]], "response_spans": [[0, 37], [37, 77], [77, 120], [120, 211], [211, 272], [272, 277], [277, 303], [305, 366], [366, 457], [457, 491], [491, 525], [525, 562], [564, 679], [-1, 120], [800, 883], [884, 945], [945, 988], [988, 1048], [1050, 1102], [1103, 1182], [1183, 1226], [1227, 1259], [-1, 111], [1371, 1504]]}