{"source_units": ["I was shopping at my local supermarket", "as I normally have for years.", "One particular day, I had done about 2 weeks’ worth of shopping", "and was headed toward the register to pay for my groceries.", "I reached into my back right pocket", "to grab the money to pay", "and noticed that there was no money in there.", "I started to get nervous.", "I knew my pocket book was in the car ", "and I was sure I had put the money in my back right pocket.", "I look at cashier with a confused look,", "not knowing what to do.", "There were people behind me on the line ", "and I immediately thought about the money I left in the car", "that was intended to pay rent this month.", "She told me to speak with the courtesy counter.", "I laughed and said,", "\"But it was cash, no one would hand that in!\"  ", "I decided that there was no harm in checking ", "so I walked up to a woman behind the counter ", "and said \"I have to ask, did anyone turn in cash by any chance?\"", "She asked \"How much?\"  ", "My face then lit up.", "\"$200 ", "in the form of twenty dollar bills.\" I replied.", "She said, \"Actually, yes, someone did!\"  ", "I was so surprised! ", "\"Who? I want to thank them.\"  ", "She points to a young girl ", "about 10 years old ", "and says, \"She did.\" ", "I walked over to the mom", "and hugged her.", "She said, \"It wasn't me, it was my daughter\". ", "I was so happy, ", "I was almost in tears. ", "I decided in those moments to do my duty ", "to pay forward this act of kindness ", "every opportunity I had."], "response_units": ["i do not believe that i recall this story .", "  the one that keeps popping into my mind is the one about the cat , so i will write that one . \t\t\t\t\t\t", "on a saturday morning , a man and his cat were hanging out eating breakfast .", "the cat was outside by the pool and the man was at the table eating breakfast .", "the cat knocked its paw on the glass door , which meant that it wanted its food .", "the man knew that because he knew everything about his cat .", "well almost .", "  for the life of him he did not know where the cat went on saturdays at noon . \t\t\t\t\t\t", "when it was 1130 the man looked around and realized that the cat was nowhere to be found .", "he went out to the street and saw the cat walking towards town .", "it took a right at the corner that would bring it to a small strip mall .", "the man decided to follow the cat to see where it went .", "when it got to the small strip mall , the cat went back towards the back alleyway where the shops were .", "at right about noon , a man came out of the back of the"], "correspondences": [-2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2, -2], "source_spans": [[0, 38], [38, 67], [67, 130], [130, 189], [189, 224], [224, 248], [248, 293], [293, 318], [318, 355], [355, 414], [414, 453], [453, 476], [476, 516], [516, 575], [575, 616], [616, 663], [663, 682], [682, 729], [729, 774], [774, 819], [819, 883], [883, 906], [906, 926], [926, 932], [932, 979], [979, 1020], [1020, 1040], [1040, 1070], [1070, 1097], [1097, 1116], [1116, 1137], [1137, 1161], [1161, 1176], [1176, 1222], [1222, 1238], [1238, 1261], [1261, 1302], [1302, 1338], [1338, 1362]], "response_spans": [[0, 42], [-1, 98], [141, 216], [217, 295], [296, 375], [376, 435], [436, 448], [-1, 83], [532, 621], [622, 685], [686, 758], [759, 814], [815, 917], [918, 972]]}